{
  "nbformat": 4,
  "nbformat_minor": 0,
  "metadata": {
    "colab": {
      "provenance": [],
      "machine_shape": "hm",
      "gpuType": "L4"
    },
    "kernelspec": {
      "name": "python3",
      "display_name": "Python 3"
    },
    "language_info": {
      "name": "python"
    },
    "accelerator": "GPU",
    "widgets": {
      "application/vnd.jupyter.widget-state+json": {
        "1f2cf7a26d5b467793ed0f5ee3a9d947": {
          "model_module": "@jupyter-widgets/controls",
          "model_name": "HBoxModel",
          "model_module_version": "1.5.0",
          "state": {
            "_dom_classes": [],
            "_model_module": "@jupyter-widgets/controls",
            "_model_module_version": "1.5.0",
            "_model_name": "HBoxModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/controls",
            "_view_module_version": "1.5.0",
            "_view_name": "HBoxView",
            "box_style": "",
            "children": [
              "IPY_MODEL_a0e8f15c35674381b848c2817905e4d4",
              "IPY_MODEL_4a9e4887246d4839b6a7f007aa5cc09d",
              "IPY_MODEL_f24f51e7c26047d785fb10b294a8d92b"
            ],
            "layout": "IPY_MODEL_ded19fcc6fbe442d892862f9e28ea902"
          }
        },
        "a0e8f15c35674381b848c2817905e4d4": {
          "model_module": "@jupyter-widgets/controls",
          "model_name": "HTMLModel",
          "model_module_version": "1.5.0",
          "state": {
            "_dom_classes": [],
            "_model_module": "@jupyter-widgets/controls",
            "_model_module_version": "1.5.0",
            "_model_name": "HTMLModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/controls",
            "_view_module_version": "1.5.0",
            "_view_name": "HTMLView",
            "description": "",
            "description_tooltip": null,
            "layout": "IPY_MODEL_f0e56132cee14008b6231f0c8cc6f2cb",
            "placeholder": "​",
            "style": "IPY_MODEL_31d8a8d993784f00bff2683413a61094",
            "value": "Loading checkpoint shards: 100%"
          }
        },
        "4a9e4887246d4839b6a7f007aa5cc09d": {
          "model_module": "@jupyter-widgets/controls",
          "model_name": "FloatProgressModel",
          "model_module_version": "1.5.0",
          "state": {
            "_dom_classes": [],
            "_model_module": "@jupyter-widgets/controls",
            "_model_module_version": "1.5.0",
            "_model_name": "FloatProgressModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/controls",
            "_view_module_version": "1.5.0",
            "_view_name": "ProgressView",
            "bar_style": "success",
            "description": "",
            "description_tooltip": null,
            "layout": "IPY_MODEL_725b62c5001747beba27202158c391ca",
            "max": 4,
            "min": 0,
            "orientation": "horizontal",
            "style": "IPY_MODEL_1c47834504dc46258890d6634f9f18b9",
            "value": 4
          }
        },
        "f24f51e7c26047d785fb10b294a8d92b": {
          "model_module": "@jupyter-widgets/controls",
          "model_name": "HTMLModel",
          "model_module_version": "1.5.0",
          "state": {
            "_dom_classes": [],
            "_model_module": "@jupyter-widgets/controls",
            "_model_module_version": "1.5.0",
            "_model_name": "HTMLModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/controls",
            "_view_module_version": "1.5.0",
            "_view_name": "HTMLView",
            "description": "",
            "description_tooltip": null,
            "layout": "IPY_MODEL_7ab96cd8aab74457b22a7e7c850ac423",
            "placeholder": "​",
            "style": "IPY_MODEL_e15a961cf32440ba91bf60983c1c6485",
            "value": " 4/4 [00:01&lt;00:00,  2.77it/s]"
          }
        },
        "ded19fcc6fbe442d892862f9e28ea902": {
          "model_module": "@jupyter-widgets/base",
          "model_name": "LayoutModel",
          "model_module_version": "1.2.0",
          "state": {
            "_model_module": "@jupyter-widgets/base",
            "_model_module_version": "1.2.0",
            "_model_name": "LayoutModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/base",
            "_view_module_version": "1.2.0",
            "_view_name": "LayoutView",
            "align_content": null,
            "align_items": null,
            "align_self": null,
            "border": null,
            "bottom": null,
            "display": null,
            "flex": null,
            "flex_flow": null,
            "grid_area": null,
            "grid_auto_columns": null,
            "grid_auto_flow": null,
            "grid_auto_rows": null,
            "grid_column": null,
            "grid_gap": null,
            "grid_row": null,
            "grid_template_areas": null,
            "grid_template_columns": null,
            "grid_template_rows": null,
            "height": null,
            "justify_content": null,
            "justify_items": null,
            "left": null,
            "margin": null,
            "max_height": null,
            "max_width": null,
            "min_height": null,
            "min_width": null,
            "object_fit": null,
            "object_position": null,
            "order": null,
            "overflow": null,
            "overflow_x": null,
            "overflow_y": null,
            "padding": null,
            "right": null,
            "top": null,
            "visibility": null,
            "width": null
          }
        },
        "f0e56132cee14008b6231f0c8cc6f2cb": {
          "model_module": "@jupyter-widgets/base",
          "model_name": "LayoutModel",
          "model_module_version": "1.2.0",
          "state": {
            "_model_module": "@jupyter-widgets/base",
            "_model_module_version": "1.2.0",
            "_model_name": "LayoutModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/base",
            "_view_module_version": "1.2.0",
            "_view_name": "LayoutView",
            "align_content": null,
            "align_items": null,
            "align_self": null,
            "border": null,
            "bottom": null,
            "display": null,
            "flex": null,
            "flex_flow": null,
            "grid_area": null,
            "grid_auto_columns": null,
            "grid_auto_flow": null,
            "grid_auto_rows": null,
            "grid_column": null,
            "grid_gap": null,
            "grid_row": null,
            "grid_template_areas": null,
            "grid_template_columns": null,
            "grid_template_rows": null,
            "height": null,
            "justify_content": null,
            "justify_items": null,
            "left": null,
            "margin": null,
            "max_height": null,
            "max_width": null,
            "min_height": null,
            "min_width": null,
            "object_fit": null,
            "object_position": null,
            "order": null,
            "overflow": null,
            "overflow_x": null,
            "overflow_y": null,
            "padding": null,
            "right": null,
            "top": null,
            "visibility": null,
            "width": null
          }
        },
        "31d8a8d993784f00bff2683413a61094": {
          "model_module": "@jupyter-widgets/controls",
          "model_name": "DescriptionStyleModel",
          "model_module_version": "1.5.0",
          "state": {
            "_model_module": "@jupyter-widgets/controls",
            "_model_module_version": "1.5.0",
            "_model_name": "DescriptionStyleModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/base",
            "_view_module_version": "1.2.0",
            "_view_name": "StyleView",
            "description_width": ""
          }
        },
        "725b62c5001747beba27202158c391ca": {
          "model_module": "@jupyter-widgets/base",
          "model_name": "LayoutModel",
          "model_module_version": "1.2.0",
          "state": {
            "_model_module": "@jupyter-widgets/base",
            "_model_module_version": "1.2.0",
            "_model_name": "LayoutModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/base",
            "_view_module_version": "1.2.0",
            "_view_name": "LayoutView",
            "align_content": null,
            "align_items": null,
            "align_self": null,
            "border": null,
            "bottom": null,
            "display": null,
            "flex": null,
            "flex_flow": null,
            "grid_area": null,
            "grid_auto_columns": null,
            "grid_auto_flow": null,
            "grid_auto_rows": null,
            "grid_column": null,
            "grid_gap": null,
            "grid_row": null,
            "grid_template_areas": null,
            "grid_template_columns": null,
            "grid_template_rows": null,
            "height": null,
            "justify_content": null,
            "justify_items": null,
            "left": null,
            "margin": null,
            "max_height": null,
            "max_width": null,
            "min_height": null,
            "min_width": null,
            "object_fit": null,
            "object_position": null,
            "order": null,
            "overflow": null,
            "overflow_x": null,
            "overflow_y": null,
            "padding": null,
            "right": null,
            "top": null,
            "visibility": null,
            "width": null
          }
        },
        "1c47834504dc46258890d6634f9f18b9": {
          "model_module": "@jupyter-widgets/controls",
          "model_name": "ProgressStyleModel",
          "model_module_version": "1.5.0",
          "state": {
            "_model_module": "@jupyter-widgets/controls",
            "_model_module_version": "1.5.0",
            "_model_name": "ProgressStyleModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/base",
            "_view_module_version": "1.2.0",
            "_view_name": "StyleView",
            "bar_color": null,
            "description_width": ""
          }
        },
        "7ab96cd8aab74457b22a7e7c850ac423": {
          "model_module": "@jupyter-widgets/base",
          "model_name": "LayoutModel",
          "model_module_version": "1.2.0",
          "state": {
            "_model_module": "@jupyter-widgets/base",
            "_model_module_version": "1.2.0",
            "_model_name": "LayoutModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/base",
            "_view_module_version": "1.2.0",
            "_view_name": "LayoutView",
            "align_content": null,
            "align_items": null,
            "align_self": null,
            "border": null,
            "bottom": null,
            "display": null,
            "flex": null,
            "flex_flow": null,
            "grid_area": null,
            "grid_auto_columns": null,
            "grid_auto_flow": null,
            "grid_auto_rows": null,
            "grid_column": null,
            "grid_gap": null,
            "grid_row": null,
            "grid_template_areas": null,
            "grid_template_columns": null,
            "grid_template_rows": null,
            "height": null,
            "justify_content": null,
            "justify_items": null,
            "left": null,
            "margin": null,
            "max_height": null,
            "max_width": null,
            "min_height": null,
            "min_width": null,
            "object_fit": null,
            "object_position": null,
            "order": null,
            "overflow": null,
            "overflow_x": null,
            "overflow_y": null,
            "padding": null,
            "right": null,
            "top": null,
            "visibility": null,
            "width": null
          }
        },
        "e15a961cf32440ba91bf60983c1c6485": {
          "model_module": "@jupyter-widgets/controls",
          "model_name": "DescriptionStyleModel",
          "model_module_version": "1.5.0",
          "state": {
            "_model_module": "@jupyter-widgets/controls",
            "_model_module_version": "1.5.0",
            "_model_name": "DescriptionStyleModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/base",
            "_view_module_version": "1.2.0",
            "_view_name": "StyleView",
            "description_width": ""
          }
        },
        "6781946cd5254a7fa27318783f7bf753": {
          "model_module": "@jupyter-widgets/controls",
          "model_name": "VBoxModel",
          "model_module_version": "1.5.0",
          "state": {
            "_dom_classes": [],
            "_model_module": "@jupyter-widgets/controls",
            "_model_module_version": "1.5.0",
            "_model_name": "VBoxModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/controls",
            "_view_module_version": "1.5.0",
            "_view_name": "VBoxView",
            "box_style": "",
            "children": [
              "IPY_MODEL_487afec7da554c8dacdb899755e2c8ef"
            ],
            "layout": "IPY_MODEL_fe60b4b50eae4fda894b7c8dceb251e9"
          }
        },
        "1699df7abe5e4b56ae78b7d8f3e121fb": {
          "model_module": "@jupyter-widgets/controls",
          "model_name": "HTMLModel",
          "model_module_version": "1.5.0",
          "state": {
            "_dom_classes": [],
            "_model_module": "@jupyter-widgets/controls",
            "_model_module_version": "1.5.0",
            "_model_name": "HTMLModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/controls",
            "_view_module_version": "1.5.0",
            "_view_name": "HTMLView",
            "description": "",
            "description_tooltip": null,
            "layout": "IPY_MODEL_b3fd6399977d4bd3b687bb70c4cc5c85",
            "placeholder": "​",
            "style": "IPY_MODEL_13b14d02ffda41a4bd2b5869c1c4f511",
            "value": "<center> <img\nsrc=https://huggingface.co/front/assets/huggingface_logo-noborder.svg\nalt='Hugging Face'> <br> Copy a token from <a\nhref=\"https://huggingface.co/settings/tokens\" target=\"_blank\">your Hugging Face\ntokens page</a> and paste it below. <br> Immediately click login after copying\nyour token or it might be stored in plain text in this notebook file. </center>"
          }
        },
        "7db265a6de9b448a9a4fd2aaa8d78092": {
          "model_module": "@jupyter-widgets/controls",
          "model_name": "PasswordModel",
          "model_module_version": "1.5.0",
          "state": {
            "_dom_classes": [],
            "_model_module": "@jupyter-widgets/controls",
            "_model_module_version": "1.5.0",
            "_model_name": "PasswordModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/controls",
            "_view_module_version": "1.5.0",
            "_view_name": "PasswordView",
            "continuous_update": true,
            "description": "Token:",
            "description_tooltip": null,
            "disabled": false,
            "layout": "IPY_MODEL_bc029b2acb08462593df3a044510d9ab",
            "placeholder": "​",
            "style": "IPY_MODEL_5c086ecc2eaf491f9fca71163d602955",
            "value": ""
          }
        },
        "11e4ac162ecc4926aba5ef85650821de": {
          "model_module": "@jupyter-widgets/controls",
          "model_name": "CheckboxModel",
          "model_module_version": "1.5.0",
          "state": {
            "_dom_classes": [],
            "_model_module": "@jupyter-widgets/controls",
            "_model_module_version": "1.5.0",
            "_model_name": "CheckboxModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/controls",
            "_view_module_version": "1.5.0",
            "_view_name": "CheckboxView",
            "description": "Add token as git credential?",
            "description_tooltip": null,
            "disabled": false,
            "indent": true,
            "layout": "IPY_MODEL_ef2a22615523497b969bdc6bdb80333b",
            "style": "IPY_MODEL_1b918e855c764fc5999b15e26ea99a6d",
            "value": true
          }
        },
        "dd4248ff241d4dd1a73ce0027e1fa88f": {
          "model_module": "@jupyter-widgets/controls",
          "model_name": "ButtonModel",
          "model_module_version": "1.5.0",
          "state": {
            "_dom_classes": [],
            "_model_module": "@jupyter-widgets/controls",
            "_model_module_version": "1.5.0",
            "_model_name": "ButtonModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/controls",
            "_view_module_version": "1.5.0",
            "_view_name": "ButtonView",
            "button_style": "",
            "description": "Login",
            "disabled": false,
            "icon": "",
            "layout": "IPY_MODEL_d0dbbc576b32430f926c8c83cf1b87cc",
            "style": "IPY_MODEL_df70bb5235004354ac89e0497853fc4b",
            "tooltip": ""
          }
        },
        "effc1b6d4be44859bc4e6082ce9a46e2": {
          "model_module": "@jupyter-widgets/controls",
          "model_name": "HTMLModel",
          "model_module_version": "1.5.0",
          "state": {
            "_dom_classes": [],
            "_model_module": "@jupyter-widgets/controls",
            "_model_module_version": "1.5.0",
            "_model_name": "HTMLModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/controls",
            "_view_module_version": "1.5.0",
            "_view_name": "HTMLView",
            "description": "",
            "description_tooltip": null,
            "layout": "IPY_MODEL_1a0282bb0bbc46b680ff449a60c676d2",
            "placeholder": "​",
            "style": "IPY_MODEL_e62e3a7ae7c14c73a985423a597926d2",
            "value": "\n<b>Pro Tip:</b> If you don't already have one, you can create a dedicated\n'notebooks' token with 'write' access, that you can then easily reuse for all\nnotebooks. </center>"
          }
        },
        "fe60b4b50eae4fda894b7c8dceb251e9": {
          "model_module": "@jupyter-widgets/base",
          "model_name": "LayoutModel",
          "model_module_version": "1.2.0",
          "state": {
            "_model_module": "@jupyter-widgets/base",
            "_model_module_version": "1.2.0",
            "_model_name": "LayoutModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/base",
            "_view_module_version": "1.2.0",
            "_view_name": "LayoutView",
            "align_content": null,
            "align_items": "center",
            "align_self": null,
            "border": null,
            "bottom": null,
            "display": "flex",
            "flex": null,
            "flex_flow": "column",
            "grid_area": null,
            "grid_auto_columns": null,
            "grid_auto_flow": null,
            "grid_auto_rows": null,
            "grid_column": null,
            "grid_gap": null,
            "grid_row": null,
            "grid_template_areas": null,
            "grid_template_columns": null,
            "grid_template_rows": null,
            "height": null,
            "justify_content": null,
            "justify_items": null,
            "left": null,
            "margin": null,
            "max_height": null,
            "max_width": null,
            "min_height": null,
            "min_width": null,
            "object_fit": null,
            "object_position": null,
            "order": null,
            "overflow": null,
            "overflow_x": null,
            "overflow_y": null,
            "padding": null,
            "right": null,
            "top": null,
            "visibility": null,
            "width": "50%"
          }
        },
        "b3fd6399977d4bd3b687bb70c4cc5c85": {
          "model_module": "@jupyter-widgets/base",
          "model_name": "LayoutModel",
          "model_module_version": "1.2.0",
          "state": {
            "_model_module": "@jupyter-widgets/base",
            "_model_module_version": "1.2.0",
            "_model_name": "LayoutModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/base",
            "_view_module_version": "1.2.0",
            "_view_name": "LayoutView",
            "align_content": null,
            "align_items": null,
            "align_self": null,
            "border": null,
            "bottom": null,
            "display": null,
            "flex": null,
            "flex_flow": null,
            "grid_area": null,
            "grid_auto_columns": null,
            "grid_auto_flow": null,
            "grid_auto_rows": null,
            "grid_column": null,
            "grid_gap": null,
            "grid_row": null,
            "grid_template_areas": null,
            "grid_template_columns": null,
            "grid_template_rows": null,
            "height": null,
            "justify_content": null,
            "justify_items": null,
            "left": null,
            "margin": null,
            "max_height": null,
            "max_width": null,
            "min_height": null,
            "min_width": null,
            "object_fit": null,
            "object_position": null,
            "order": null,
            "overflow": null,
            "overflow_x": null,
            "overflow_y": null,
            "padding": null,
            "right": null,
            "top": null,
            "visibility": null,
            "width": null
          }
        },
        "13b14d02ffda41a4bd2b5869c1c4f511": {
          "model_module": "@jupyter-widgets/controls",
          "model_name": "DescriptionStyleModel",
          "model_module_version": "1.5.0",
          "state": {
            "_model_module": "@jupyter-widgets/controls",
            "_model_module_version": "1.5.0",
            "_model_name": "DescriptionStyleModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/base",
            "_view_module_version": "1.2.0",
            "_view_name": "StyleView",
            "description_width": ""
          }
        },
        "bc029b2acb08462593df3a044510d9ab": {
          "model_module": "@jupyter-widgets/base",
          "model_name": "LayoutModel",
          "model_module_version": "1.2.0",
          "state": {
            "_model_module": "@jupyter-widgets/base",
            "_model_module_version": "1.2.0",
            "_model_name": "LayoutModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/base",
            "_view_module_version": "1.2.0",
            "_view_name": "LayoutView",
            "align_content": null,
            "align_items": null,
            "align_self": null,
            "border": null,
            "bottom": null,
            "display": null,
            "flex": null,
            "flex_flow": null,
            "grid_area": null,
            "grid_auto_columns": null,
            "grid_auto_flow": null,
            "grid_auto_rows": null,
            "grid_column": null,
            "grid_gap": null,
            "grid_row": null,
            "grid_template_areas": null,
            "grid_template_columns": null,
            "grid_template_rows": null,
            "height": null,
            "justify_content": null,
            "justify_items": null,
            "left": null,
            "margin": null,
            "max_height": null,
            "max_width": null,
            "min_height": null,
            "min_width": null,
            "object_fit": null,
            "object_position": null,
            "order": null,
            "overflow": null,
            "overflow_x": null,
            "overflow_y": null,
            "padding": null,
            "right": null,
            "top": null,
            "visibility": null,
            "width": null
          }
        },
        "5c086ecc2eaf491f9fca71163d602955": {
          "model_module": "@jupyter-widgets/controls",
          "model_name": "DescriptionStyleModel",
          "model_module_version": "1.5.0",
          "state": {
            "_model_module": "@jupyter-widgets/controls",
            "_model_module_version": "1.5.0",
            "_model_name": "DescriptionStyleModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/base",
            "_view_module_version": "1.2.0",
            "_view_name": "StyleView",
            "description_width": ""
          }
        },
        "ef2a22615523497b969bdc6bdb80333b": {
          "model_module": "@jupyter-widgets/base",
          "model_name": "LayoutModel",
          "model_module_version": "1.2.0",
          "state": {
            "_model_module": "@jupyter-widgets/base",
            "_model_module_version": "1.2.0",
            "_model_name": "LayoutModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/base",
            "_view_module_version": "1.2.0",
            "_view_name": "LayoutView",
            "align_content": null,
            "align_items": null,
            "align_self": null,
            "border": null,
            "bottom": null,
            "display": null,
            "flex": null,
            "flex_flow": null,
            "grid_area": null,
            "grid_auto_columns": null,
            "grid_auto_flow": null,
            "grid_auto_rows": null,
            "grid_column": null,
            "grid_gap": null,
            "grid_row": null,
            "grid_template_areas": null,
            "grid_template_columns": null,
            "grid_template_rows": null,
            "height": null,
            "justify_content": null,
            "justify_items": null,
            "left": null,
            "margin": null,
            "max_height": null,
            "max_width": null,
            "min_height": null,
            "min_width": null,
            "object_fit": null,
            "object_position": null,
            "order": null,
            "overflow": null,
            "overflow_x": null,
            "overflow_y": null,
            "padding": null,
            "right": null,
            "top": null,
            "visibility": null,
            "width": null
          }
        },
        "1b918e855c764fc5999b15e26ea99a6d": {
          "model_module": "@jupyter-widgets/controls",
          "model_name": "DescriptionStyleModel",
          "model_module_version": "1.5.0",
          "state": {
            "_model_module": "@jupyter-widgets/controls",
            "_model_module_version": "1.5.0",
            "_model_name": "DescriptionStyleModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/base",
            "_view_module_version": "1.2.0",
            "_view_name": "StyleView",
            "description_width": ""
          }
        },
        "d0dbbc576b32430f926c8c83cf1b87cc": {
          "model_module": "@jupyter-widgets/base",
          "model_name": "LayoutModel",
          "model_module_version": "1.2.0",
          "state": {
            "_model_module": "@jupyter-widgets/base",
            "_model_module_version": "1.2.0",
            "_model_name": "LayoutModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/base",
            "_view_module_version": "1.2.0",
            "_view_name": "LayoutView",
            "align_content": null,
            "align_items": null,
            "align_self": null,
            "border": null,
            "bottom": null,
            "display": null,
            "flex": null,
            "flex_flow": null,
            "grid_area": null,
            "grid_auto_columns": null,
            "grid_auto_flow": null,
            "grid_auto_rows": null,
            "grid_column": null,
            "grid_gap": null,
            "grid_row": null,
            "grid_template_areas": null,
            "grid_template_columns": null,
            "grid_template_rows": null,
            "height": null,
            "justify_content": null,
            "justify_items": null,
            "left": null,
            "margin": null,
            "max_height": null,
            "max_width": null,
            "min_height": null,
            "min_width": null,
            "object_fit": null,
            "object_position": null,
            "order": null,
            "overflow": null,
            "overflow_x": null,
            "overflow_y": null,
            "padding": null,
            "right": null,
            "top": null,
            "visibility": null,
            "width": null
          }
        },
        "df70bb5235004354ac89e0497853fc4b": {
          "model_module": "@jupyter-widgets/controls",
          "model_name": "ButtonStyleModel",
          "model_module_version": "1.5.0",
          "state": {
            "_model_module": "@jupyter-widgets/controls",
            "_model_module_version": "1.5.0",
            "_model_name": "ButtonStyleModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/base",
            "_view_module_version": "1.2.0",
            "_view_name": "StyleView",
            "button_color": null,
            "font_weight": ""
          }
        },
        "1a0282bb0bbc46b680ff449a60c676d2": {
          "model_module": "@jupyter-widgets/base",
          "model_name": "LayoutModel",
          "model_module_version": "1.2.0",
          "state": {
            "_model_module": "@jupyter-widgets/base",
            "_model_module_version": "1.2.0",
            "_model_name": "LayoutModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/base",
            "_view_module_version": "1.2.0",
            "_view_name": "LayoutView",
            "align_content": null,
            "align_items": null,
            "align_self": null,
            "border": null,
            "bottom": null,
            "display": null,
            "flex": null,
            "flex_flow": null,
            "grid_area": null,
            "grid_auto_columns": null,
            "grid_auto_flow": null,
            "grid_auto_rows": null,
            "grid_column": null,
            "grid_gap": null,
            "grid_row": null,
            "grid_template_areas": null,
            "grid_template_columns": null,
            "grid_template_rows": null,
            "height": null,
            "justify_content": null,
            "justify_items": null,
            "left": null,
            "margin": null,
            "max_height": null,
            "max_width": null,
            "min_height": null,
            "min_width": null,
            "object_fit": null,
            "object_position": null,
            "order": null,
            "overflow": null,
            "overflow_x": null,
            "overflow_y": null,
            "padding": null,
            "right": null,
            "top": null,
            "visibility": null,
            "width": null
          }
        },
        "e62e3a7ae7c14c73a985423a597926d2": {
          "model_module": "@jupyter-widgets/controls",
          "model_name": "DescriptionStyleModel",
          "model_module_version": "1.5.0",
          "state": {
            "_model_module": "@jupyter-widgets/controls",
            "_model_module_version": "1.5.0",
            "_model_name": "DescriptionStyleModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/base",
            "_view_module_version": "1.2.0",
            "_view_name": "StyleView",
            "description_width": ""
          }
        },
        "7bba1d63b27f4d13b6c94a12ca47e724": {
          "model_module": "@jupyter-widgets/controls",
          "model_name": "LabelModel",
          "model_module_version": "1.5.0",
          "state": {
            "_dom_classes": [],
            "_model_module": "@jupyter-widgets/controls",
            "_model_module_version": "1.5.0",
            "_model_name": "LabelModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/controls",
            "_view_module_version": "1.5.0",
            "_view_name": "LabelView",
            "description": "",
            "description_tooltip": null,
            "layout": "IPY_MODEL_3cf21436c3da453fb7cbc1aa57eaf985",
            "placeholder": "​",
            "style": "IPY_MODEL_6516e6c8fb754b61887facd07c649379",
            "value": "Connecting..."
          }
        },
        "3cf21436c3da453fb7cbc1aa57eaf985": {
          "model_module": "@jupyter-widgets/base",
          "model_name": "LayoutModel",
          "model_module_version": "1.2.0",
          "state": {
            "_model_module": "@jupyter-widgets/base",
            "_model_module_version": "1.2.0",
            "_model_name": "LayoutModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/base",
            "_view_module_version": "1.2.0",
            "_view_name": "LayoutView",
            "align_content": null,
            "align_items": null,
            "align_self": null,
            "border": null,
            "bottom": null,
            "display": null,
            "flex": null,
            "flex_flow": null,
            "grid_area": null,
            "grid_auto_columns": null,
            "grid_auto_flow": null,
            "grid_auto_rows": null,
            "grid_column": null,
            "grid_gap": null,
            "grid_row": null,
            "grid_template_areas": null,
            "grid_template_columns": null,
            "grid_template_rows": null,
            "height": null,
            "justify_content": null,
            "justify_items": null,
            "left": null,
            "margin": null,
            "max_height": null,
            "max_width": null,
            "min_height": null,
            "min_width": null,
            "object_fit": null,
            "object_position": null,
            "order": null,
            "overflow": null,
            "overflow_x": null,
            "overflow_y": null,
            "padding": null,
            "right": null,
            "top": null,
            "visibility": null,
            "width": null
          }
        },
        "6516e6c8fb754b61887facd07c649379": {
          "model_module": "@jupyter-widgets/controls",
          "model_name": "DescriptionStyleModel",
          "model_module_version": "1.5.0",
          "state": {
            "_model_module": "@jupyter-widgets/controls",
            "_model_module_version": "1.5.0",
            "_model_name": "DescriptionStyleModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/base",
            "_view_module_version": "1.2.0",
            "_view_name": "StyleView",
            "description_width": ""
          }
        },
        "4f495e2f2c7c45a1b324bc883d505b0c": {
          "model_module": "@jupyter-widgets/controls",
          "model_name": "LabelModel",
          "model_module_version": "1.5.0",
          "state": {
            "_dom_classes": [],
            "_model_module": "@jupyter-widgets/controls",
            "_model_module_version": "1.5.0",
            "_model_name": "LabelModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/controls",
            "_view_module_version": "1.5.0",
            "_view_name": "LabelView",
            "description": "",
            "description_tooltip": null,
            "layout": "IPY_MODEL_4e038836561c4c3f89fe4735ec0098e7",
            "placeholder": "​",
            "style": "IPY_MODEL_0adfa1d32f984ce6bff9fe563cec6555",
            "value": "Connecting..."
          }
        },
        "4e038836561c4c3f89fe4735ec0098e7": {
          "model_module": "@jupyter-widgets/base",
          "model_name": "LayoutModel",
          "model_module_version": "1.2.0",
          "state": {
            "_model_module": "@jupyter-widgets/base",
            "_model_module_version": "1.2.0",
            "_model_name": "LayoutModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/base",
            "_view_module_version": "1.2.0",
            "_view_name": "LayoutView",
            "align_content": null,
            "align_items": null,
            "align_self": null,
            "border": null,
            "bottom": null,
            "display": null,
            "flex": null,
            "flex_flow": null,
            "grid_area": null,
            "grid_auto_columns": null,
            "grid_auto_flow": null,
            "grid_auto_rows": null,
            "grid_column": null,
            "grid_gap": null,
            "grid_row": null,
            "grid_template_areas": null,
            "grid_template_columns": null,
            "grid_template_rows": null,
            "height": null,
            "justify_content": null,
            "justify_items": null,
            "left": null,
            "margin": null,
            "max_height": null,
            "max_width": null,
            "min_height": null,
            "min_width": null,
            "object_fit": null,
            "object_position": null,
            "order": null,
            "overflow": null,
            "overflow_x": null,
            "overflow_y": null,
            "padding": null,
            "right": null,
            "top": null,
            "visibility": null,
            "width": null
          }
        },
        "0adfa1d32f984ce6bff9fe563cec6555": {
          "model_module": "@jupyter-widgets/controls",
          "model_name": "DescriptionStyleModel",
          "model_module_version": "1.5.0",
          "state": {
            "_model_module": "@jupyter-widgets/controls",
            "_model_module_version": "1.5.0",
            "_model_name": "DescriptionStyleModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/base",
            "_view_module_version": "1.2.0",
            "_view_name": "StyleView",
            "description_width": ""
          }
        },
        "487afec7da554c8dacdb899755e2c8ef": {
          "model_module": "@jupyter-widgets/controls",
          "model_name": "LabelModel",
          "model_module_version": "1.5.0",
          "state": {
            "_dom_classes": [],
            "_model_module": "@jupyter-widgets/controls",
            "_model_module_version": "1.5.0",
            "_model_name": "LabelModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/controls",
            "_view_module_version": "1.5.0",
            "_view_name": "LabelView",
            "description": "",
            "description_tooltip": null,
            "layout": "IPY_MODEL_d797bc2d9ced4361b56ec1febfdf95f9",
            "placeholder": "​",
            "style": "IPY_MODEL_d441cb9dd13245aa9eb7693b0fcf897d",
            "value": "Token aleclee369 not found in /root/.cache/huggingface/stored_tokens"
          }
        },
        "d797bc2d9ced4361b56ec1febfdf95f9": {
          "model_module": "@jupyter-widgets/base",
          "model_name": "LayoutModel",
          "model_module_version": "1.2.0",
          "state": {
            "_model_module": "@jupyter-widgets/base",
            "_model_module_version": "1.2.0",
            "_model_name": "LayoutModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/base",
            "_view_module_version": "1.2.0",
            "_view_name": "LayoutView",
            "align_content": null,
            "align_items": null,
            "align_self": null,
            "border": null,
            "bottom": null,
            "display": null,
            "flex": null,
            "flex_flow": null,
            "grid_area": null,
            "grid_auto_columns": null,
            "grid_auto_flow": null,
            "grid_auto_rows": null,
            "grid_column": null,
            "grid_gap": null,
            "grid_row": null,
            "grid_template_areas": null,
            "grid_template_columns": null,
            "grid_template_rows": null,
            "height": null,
            "justify_content": null,
            "justify_items": null,
            "left": null,
            "margin": null,
            "max_height": null,
            "max_width": null,
            "min_height": null,
            "min_width": null,
            "object_fit": null,
            "object_position": null,
            "order": null,
            "overflow": null,
            "overflow_x": null,
            "overflow_y": null,
            "padding": null,
            "right": null,
            "top": null,
            "visibility": null,
            "width": null
          }
        },
        "d441cb9dd13245aa9eb7693b0fcf897d": {
          "model_module": "@jupyter-widgets/controls",
          "model_name": "DescriptionStyleModel",
          "model_module_version": "1.5.0",
          "state": {
            "_model_module": "@jupyter-widgets/controls",
            "_model_module_version": "1.5.0",
            "_model_name": "DescriptionStyleModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/base",
            "_view_module_version": "1.2.0",
            "_view_name": "StyleView",
            "description_width": ""
          }
        },
        "9caf5db719494b90b148b27a10fe86f7": {
          "model_module": "@jupyter-widgets/controls",
          "model_name": "HBoxModel",
          "model_module_version": "1.5.0",
          "state": {
            "_dom_classes": [],
            "_model_module": "@jupyter-widgets/controls",
            "_model_module_version": "1.5.0",
            "_model_name": "HBoxModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/controls",
            "_view_module_version": "1.5.0",
            "_view_name": "HBoxView",
            "box_style": "",
            "children": [
              "IPY_MODEL_675e5fb93a4b474ba96c78c1216b6b5c",
              "IPY_MODEL_2aac871de0fd46d49d4fb6efdc7c1ef0",
              "IPY_MODEL_49f600813a9f4174bb4d0ee49e8a353d"
            ],
            "layout": "IPY_MODEL_ca90459492d34489a4cb2bc263738f6d"
          }
        },
        "675e5fb93a4b474ba96c78c1216b6b5c": {
          "model_module": "@jupyter-widgets/controls",
          "model_name": "HTMLModel",
          "model_module_version": "1.5.0",
          "state": {
            "_dom_classes": [],
            "_model_module": "@jupyter-widgets/controls",
            "_model_module_version": "1.5.0",
            "_model_name": "HTMLModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/controls",
            "_view_module_version": "1.5.0",
            "_view_name": "HTMLView",
            "description": "",
            "description_tooltip": null,
            "layout": "IPY_MODEL_bb7ce9c9dca44d6d92ee9ea3c23b5196",
            "placeholder": "​",
            "style": "IPY_MODEL_bc9e4eac82b4453e800ee2d9ff210445",
            "value": "Loading checkpoint shards: 100%"
          }
        },
        "2aac871de0fd46d49d4fb6efdc7c1ef0": {
          "model_module": "@jupyter-widgets/controls",
          "model_name": "FloatProgressModel",
          "model_module_version": "1.5.0",
          "state": {
            "_dom_classes": [],
            "_model_module": "@jupyter-widgets/controls",
            "_model_module_version": "1.5.0",
            "_model_name": "FloatProgressModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/controls",
            "_view_module_version": "1.5.0",
            "_view_name": "ProgressView",
            "bar_style": "success",
            "description": "",
            "description_tooltip": null,
            "layout": "IPY_MODEL_66466156c8714d1cb18b29ff936550aa",
            "max": 2,
            "min": 0,
            "orientation": "horizontal",
            "style": "IPY_MODEL_9fbc983f3e4e4fe48d510d6f7189d215",
            "value": 2
          }
        },
        "49f600813a9f4174bb4d0ee49e8a353d": {
          "model_module": "@jupyter-widgets/controls",
          "model_name": "HTMLModel",
          "model_module_version": "1.5.0",
          "state": {
            "_dom_classes": [],
            "_model_module": "@jupyter-widgets/controls",
            "_model_module_version": "1.5.0",
            "_model_name": "HTMLModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/controls",
            "_view_module_version": "1.5.0",
            "_view_name": "HTMLView",
            "description": "",
            "description_tooltip": null,
            "layout": "IPY_MODEL_2557eb04cc9745a7b2a5b2a3897e6dcc",
            "placeholder": "​",
            "style": "IPY_MODEL_361844a359784a2ea63c71570fac53b9",
            "value": " 2/2 [00:00&lt;00:00,  2.83it/s]"
          }
        },
        "ca90459492d34489a4cb2bc263738f6d": {
          "model_module": "@jupyter-widgets/base",
          "model_name": "LayoutModel",
          "model_module_version": "1.2.0",
          "state": {
            "_model_module": "@jupyter-widgets/base",
            "_model_module_version": "1.2.0",
            "_model_name": "LayoutModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/base",
            "_view_module_version": "1.2.0",
            "_view_name": "LayoutView",
            "align_content": null,
            "align_items": null,
            "align_self": null,
            "border": null,
            "bottom": null,
            "display": null,
            "flex": null,
            "flex_flow": null,
            "grid_area": null,
            "grid_auto_columns": null,
            "grid_auto_flow": null,
            "grid_auto_rows": null,
            "grid_column": null,
            "grid_gap": null,
            "grid_row": null,
            "grid_template_areas": null,
            "grid_template_columns": null,
            "grid_template_rows": null,
            "height": null,
            "justify_content": null,
            "justify_items": null,
            "left": null,
            "margin": null,
            "max_height": null,
            "max_width": null,
            "min_height": null,
            "min_width": null,
            "object_fit": null,
            "object_position": null,
            "order": null,
            "overflow": null,
            "overflow_x": null,
            "overflow_y": null,
            "padding": null,
            "right": null,
            "top": null,
            "visibility": null,
            "width": null
          }
        },
        "bb7ce9c9dca44d6d92ee9ea3c23b5196": {
          "model_module": "@jupyter-widgets/base",
          "model_name": "LayoutModel",
          "model_module_version": "1.2.0",
          "state": {
            "_model_module": "@jupyter-widgets/base",
            "_model_module_version": "1.2.0",
            "_model_name": "LayoutModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/base",
            "_view_module_version": "1.2.0",
            "_view_name": "LayoutView",
            "align_content": null,
            "align_items": null,
            "align_self": null,
            "border": null,
            "bottom": null,
            "display": null,
            "flex": null,
            "flex_flow": null,
            "grid_area": null,
            "grid_auto_columns": null,
            "grid_auto_flow": null,
            "grid_auto_rows": null,
            "grid_column": null,
            "grid_gap": null,
            "grid_row": null,
            "grid_template_areas": null,
            "grid_template_columns": null,
            "grid_template_rows": null,
            "height": null,
            "justify_content": null,
            "justify_items": null,
            "left": null,
            "margin": null,
            "max_height": null,
            "max_width": null,
            "min_height": null,
            "min_width": null,
            "object_fit": null,
            "object_position": null,
            "order": null,
            "overflow": null,
            "overflow_x": null,
            "overflow_y": null,
            "padding": null,
            "right": null,
            "top": null,
            "visibility": null,
            "width": null
          }
        },
        "bc9e4eac82b4453e800ee2d9ff210445": {
          "model_module": "@jupyter-widgets/controls",
          "model_name": "DescriptionStyleModel",
          "model_module_version": "1.5.0",
          "state": {
            "_model_module": "@jupyter-widgets/controls",
            "_model_module_version": "1.5.0",
            "_model_name": "DescriptionStyleModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/base",
            "_view_module_version": "1.2.0",
            "_view_name": "StyleView",
            "description_width": ""
          }
        },
        "66466156c8714d1cb18b29ff936550aa": {
          "model_module": "@jupyter-widgets/base",
          "model_name": "LayoutModel",
          "model_module_version": "1.2.0",
          "state": {
            "_model_module": "@jupyter-widgets/base",
            "_model_module_version": "1.2.0",
            "_model_name": "LayoutModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/base",
            "_view_module_version": "1.2.0",
            "_view_name": "LayoutView",
            "align_content": null,
            "align_items": null,
            "align_self": null,
            "border": null,
            "bottom": null,
            "display": null,
            "flex": null,
            "flex_flow": null,
            "grid_area": null,
            "grid_auto_columns": null,
            "grid_auto_flow": null,
            "grid_auto_rows": null,
            "grid_column": null,
            "grid_gap": null,
            "grid_row": null,
            "grid_template_areas": null,
            "grid_template_columns": null,
            "grid_template_rows": null,
            "height": null,
            "justify_content": null,
            "justify_items": null,
            "left": null,
            "margin": null,
            "max_height": null,
            "max_width": null,
            "min_height": null,
            "min_width": null,
            "object_fit": null,
            "object_position": null,
            "order": null,
            "overflow": null,
            "overflow_x": null,
            "overflow_y": null,
            "padding": null,
            "right": null,
            "top": null,
            "visibility": null,
            "width": null
          }
        },
        "9fbc983f3e4e4fe48d510d6f7189d215": {
          "model_module": "@jupyter-widgets/controls",
          "model_name": "ProgressStyleModel",
          "model_module_version": "1.5.0",
          "state": {
            "_model_module": "@jupyter-widgets/controls",
            "_model_module_version": "1.5.0",
            "_model_name": "ProgressStyleModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/base",
            "_view_module_version": "1.2.0",
            "_view_name": "StyleView",
            "bar_color": null,
            "description_width": ""
          }
        },
        "2557eb04cc9745a7b2a5b2a3897e6dcc": {
          "model_module": "@jupyter-widgets/base",
          "model_name": "LayoutModel",
          "model_module_version": "1.2.0",
          "state": {
            "_model_module": "@jupyter-widgets/base",
            "_model_module_version": "1.2.0",
            "_model_name": "LayoutModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/base",
            "_view_module_version": "1.2.0",
            "_view_name": "LayoutView",
            "align_content": null,
            "align_items": null,
            "align_self": null,
            "border": null,
            "bottom": null,
            "display": null,
            "flex": null,
            "flex_flow": null,
            "grid_area": null,
            "grid_auto_columns": null,
            "grid_auto_flow": null,
            "grid_auto_rows": null,
            "grid_column": null,
            "grid_gap": null,
            "grid_row": null,
            "grid_template_areas": null,
            "grid_template_columns": null,
            "grid_template_rows": null,
            "height": null,
            "justify_content": null,
            "justify_items": null,
            "left": null,
            "margin": null,
            "max_height": null,
            "max_width": null,
            "min_height": null,
            "min_width": null,
            "object_fit": null,
            "object_position": null,
            "order": null,
            "overflow": null,
            "overflow_x": null,
            "overflow_y": null,
            "padding": null,
            "right": null,
            "top": null,
            "visibility": null,
            "width": null
          }
        },
        "361844a359784a2ea63c71570fac53b9": {
          "model_module": "@jupyter-widgets/controls",
          "model_name": "DescriptionStyleModel",
          "model_module_version": "1.5.0",
          "state": {
            "_model_module": "@jupyter-widgets/controls",
            "_model_module_version": "1.5.0",
            "_model_name": "DescriptionStyleModel",
            "_view_count": null,
            "_view_module": "@jupyter-widgets/base",
            "_view_module_version": "1.2.0",
            "_view_name": "StyleView",
            "description_width": ""
          }
        }
      }
    }
  },
  "cells": [
    {
      "cell_type": "code",
      "execution_count": null,
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "id": "IaBeUW5Et1Z6",
        "outputId": "8d6c5ad7-3dfe-4ec0-b5d1-229c206ae027"
      },
      "outputs": [
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "Collecting neo4j\n",
            "  Downloading neo4j-5.28.1-py3-none-any.whl.metadata (5.9 kB)\n",
            "Requirement already satisfied: transformers in /usr/local/lib/python3.11/dist-packages (4.48.3)\n",
            "Requirement already satisfied: accelerate in /usr/local/lib/python3.11/dist-packages (1.3.0)\n",
            "Requirement already satisfied: peft in /usr/local/lib/python3.11/dist-packages (0.14.0)\n",
            "Requirement already satisfied: pytz in /usr/local/lib/python3.11/dist-packages (from neo4j) (2025.1)\n",
            "Requirement already satisfied: filelock in /usr/local/lib/python3.11/dist-packages (from transformers) (3.17.0)\n",
            "Requirement already satisfied: huggingface-hub<1.0,>=0.24.0 in /usr/local/lib/python3.11/dist-packages (from transformers) (0.28.1)\n",
            "Requirement already satisfied: numpy>=1.17 in /usr/local/lib/python3.11/dist-packages (from transformers) (1.26.4)\n",
            "Requirement already satisfied: packaging>=20.0 in /usr/local/lib/python3.11/dist-packages (from transformers) (24.2)\n",
            "Requirement already satisfied: pyyaml>=5.1 in /usr/local/lib/python3.11/dist-packages (from transformers) (6.0.2)\n",
            "Requirement already satisfied: regex!=2019.12.17 in /usr/local/lib/python3.11/dist-packages (from transformers) (2024.11.6)\n",
            "Requirement already satisfied: requests in /usr/local/lib/python3.11/dist-packages (from transformers) (2.32.3)\n",
            "Requirement already satisfied: tokenizers<0.22,>=0.21 in /usr/local/lib/python3.11/dist-packages (from transformers) (0.21.0)\n",
            "Requirement already satisfied: safetensors>=0.4.1 in /usr/local/lib/python3.11/dist-packages (from transformers) (0.5.2)\n",
            "Requirement already satisfied: tqdm>=4.27 in /usr/local/lib/python3.11/dist-packages (from transformers) (4.67.1)\n",
            "Requirement already satisfied: psutil in /usr/local/lib/python3.11/dist-packages (from accelerate) (5.9.5)\n",
            "Requirement already satisfied: torch>=2.0.0 in /usr/local/lib/python3.11/dist-packages (from accelerate) (2.5.1+cu124)\n",
            "Requirement already satisfied: fsspec>=2023.5.0 in /usr/local/lib/python3.11/dist-packages (from huggingface-hub<1.0,>=0.24.0->transformers) (2024.10.0)\n",
            "Requirement already satisfied: typing-extensions>=3.7.4.3 in /usr/local/lib/python3.11/dist-packages (from huggingface-hub<1.0,>=0.24.0->transformers) (4.12.2)\n",
            "Requirement already satisfied: networkx in /usr/local/lib/python3.11/dist-packages (from torch>=2.0.0->accelerate) (3.4.2)\n",
            "Requirement already satisfied: jinja2 in /usr/local/lib/python3.11/dist-packages (from torch>=2.0.0->accelerate) (3.1.5)\n",
            "Collecting nvidia-cuda-nvrtc-cu12==12.4.127 (from torch>=2.0.0->accelerate)\n",
            "  Downloading nvidia_cuda_nvrtc_cu12-12.4.127-py3-none-manylinux2014_x86_64.whl.metadata (1.5 kB)\n",
            "Collecting nvidia-cuda-runtime-cu12==12.4.127 (from torch>=2.0.0->accelerate)\n",
            "  Downloading nvidia_cuda_runtime_cu12-12.4.127-py3-none-manylinux2014_x86_64.whl.metadata (1.5 kB)\n",
            "Collecting nvidia-cuda-cupti-cu12==12.4.127 (from torch>=2.0.0->accelerate)\n",
            "  Downloading nvidia_cuda_cupti_cu12-12.4.127-py3-none-manylinux2014_x86_64.whl.metadata (1.6 kB)\n",
            "Collecting nvidia-cudnn-cu12==9.1.0.70 (from torch>=2.0.0->accelerate)\n",
            "  Downloading nvidia_cudnn_cu12-9.1.0.70-py3-none-manylinux2014_x86_64.whl.metadata (1.6 kB)\n",
            "Collecting nvidia-cublas-cu12==12.4.5.8 (from torch>=2.0.0->accelerate)\n",
            "  Downloading nvidia_cublas_cu12-12.4.5.8-py3-none-manylinux2014_x86_64.whl.metadata (1.5 kB)\n",
            "Collecting nvidia-cufft-cu12==11.2.1.3 (from torch>=2.0.0->accelerate)\n",
            "  Downloading nvidia_cufft_cu12-11.2.1.3-py3-none-manylinux2014_x86_64.whl.metadata (1.5 kB)\n",
            "Collecting nvidia-curand-cu12==10.3.5.147 (from torch>=2.0.0->accelerate)\n",
            "  Downloading nvidia_curand_cu12-10.3.5.147-py3-none-manylinux2014_x86_64.whl.metadata (1.5 kB)\n",
            "Collecting nvidia-cusolver-cu12==11.6.1.9 (from torch>=2.0.0->accelerate)\n",
            "  Downloading nvidia_cusolver_cu12-11.6.1.9-py3-none-manylinux2014_x86_64.whl.metadata (1.6 kB)\n",
            "Collecting nvidia-cusparse-cu12==12.3.1.170 (from torch>=2.0.0->accelerate)\n",
            "  Downloading nvidia_cusparse_cu12-12.3.1.170-py3-none-manylinux2014_x86_64.whl.metadata (1.6 kB)\n",
            "Requirement already satisfied: nvidia-nccl-cu12==2.21.5 in /usr/local/lib/python3.11/dist-packages (from torch>=2.0.0->accelerate) (2.21.5)\n",
            "Requirement already satisfied: nvidia-nvtx-cu12==12.4.127 in /usr/local/lib/python3.11/dist-packages (from torch>=2.0.0->accelerate) (12.4.127)\n",
            "Collecting nvidia-nvjitlink-cu12==12.4.127 (from torch>=2.0.0->accelerate)\n",
            "  Downloading nvidia_nvjitlink_cu12-12.4.127-py3-none-manylinux2014_x86_64.whl.metadata (1.5 kB)\n",
            "Requirement already satisfied: triton==3.1.0 in /usr/local/lib/python3.11/dist-packages (from torch>=2.0.0->accelerate) (3.1.0)\n",
            "Requirement already satisfied: sympy==1.13.1 in /usr/local/lib/python3.11/dist-packages (from torch>=2.0.0->accelerate) (1.13.1)\n",
            "Requirement already satisfied: mpmath<1.4,>=1.1.0 in /usr/local/lib/python3.11/dist-packages (from sympy==1.13.1->torch>=2.0.0->accelerate) (1.3.0)\n",
            "Requirement already satisfied: charset-normalizer<4,>=2 in /usr/local/lib/python3.11/dist-packages (from requests->transformers) (3.4.1)\n",
            "Requirement already satisfied: idna<4,>=2.5 in /usr/local/lib/python3.11/dist-packages (from requests->transformers) (3.10)\n",
            "Requirement already satisfied: urllib3<3,>=1.21.1 in /usr/local/lib/python3.11/dist-packages (from requests->transformers) (2.3.0)\n",
            "Requirement already satisfied: certifi>=2017.4.17 in /usr/local/lib/python3.11/dist-packages (from requests->transformers) (2025.1.31)\n",
            "Requirement already satisfied: MarkupSafe>=2.0 in /usr/local/lib/python3.11/dist-packages (from jinja2->torch>=2.0.0->accelerate) (3.0.2)\n",
            "Downloading neo4j-5.28.1-py3-none-any.whl (312 kB)\n",
            "\u001b[2K   \u001b[90m━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━\u001b[0m \u001b[32m312.3/312.3 kB\u001b[0m \u001b[31m9.4 MB/s\u001b[0m eta \u001b[36m0:00:00\u001b[0m\n",
            "\u001b[?25hDownloading nvidia_cublas_cu12-12.4.5.8-py3-none-manylinux2014_x86_64.whl (363.4 MB)\n",
            "\u001b[2K   \u001b[90m━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━\u001b[0m \u001b[32m363.4/363.4 MB\u001b[0m \u001b[31m2.9 MB/s\u001b[0m eta \u001b[36m0:00:00\u001b[0m\n",
            "\u001b[?25hDownloading nvidia_cuda_cupti_cu12-12.4.127-py3-none-manylinux2014_x86_64.whl (13.8 MB)\n",
            "\u001b[2K   \u001b[90m━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━\u001b[0m \u001b[32m13.8/13.8 MB\u001b[0m \u001b[31m88.6 MB/s\u001b[0m eta \u001b[36m0:00:00\u001b[0m\n",
            "\u001b[?25hDownloading nvidia_cuda_nvrtc_cu12-12.4.127-py3-none-manylinux2014_x86_64.whl (24.6 MB)\n",
            "\u001b[2K   \u001b[90m━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━\u001b[0m \u001b[32m24.6/24.6 MB\u001b[0m \u001b[31m75.4 MB/s\u001b[0m eta \u001b[36m0:00:00\u001b[0m\n",
            "\u001b[?25hDownloading nvidia_cuda_runtime_cu12-12.4.127-py3-none-manylinux2014_x86_64.whl (883 kB)\n",
            "\u001b[2K   \u001b[90m━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━\u001b[0m \u001b[32m883.7/883.7 kB\u001b[0m \u001b[31m42.1 MB/s\u001b[0m eta \u001b[36m0:00:00\u001b[0m\n",
            "\u001b[?25hDownloading nvidia_cudnn_cu12-9.1.0.70-py3-none-manylinux2014_x86_64.whl (664.8 MB)\n",
            "\u001b[2K   \u001b[90m━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━\u001b[0m \u001b[32m664.8/664.8 MB\u001b[0m \u001b[31m2.0 MB/s\u001b[0m eta \u001b[36m0:00:00\u001b[0m\n",
            "\u001b[?25hDownloading nvidia_cufft_cu12-11.2.1.3-py3-none-manylinux2014_x86_64.whl (211.5 MB)\n",
            "\u001b[2K   \u001b[90m━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━\u001b[0m \u001b[32m211.5/211.5 MB\u001b[0m \u001b[31m4.6 MB/s\u001b[0m eta \u001b[36m0:00:00\u001b[0m\n",
            "\u001b[?25hDownloading nvidia_curand_cu12-10.3.5.147-py3-none-manylinux2014_x86_64.whl (56.3 MB)\n",
            "\u001b[2K   \u001b[90m━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━\u001b[0m \u001b[32m56.3/56.3 MB\u001b[0m \u001b[31m29.9 MB/s\u001b[0m eta \u001b[36m0:00:00\u001b[0m\n",
            "\u001b[?25hDownloading nvidia_cusolver_cu12-11.6.1.9-py3-none-manylinux2014_x86_64.whl (127.9 MB)\n",
            "\u001b[2K   \u001b[90m━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━\u001b[0m \u001b[32m127.9/127.9 MB\u001b[0m \u001b[31m17.6 MB/s\u001b[0m eta \u001b[36m0:00:00\u001b[0m\n",
            "\u001b[?25hDownloading nvidia_cusparse_cu12-12.3.1.170-py3-none-manylinux2014_x86_64.whl (207.5 MB)\n",
            "\u001b[2K   \u001b[90m━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━\u001b[0m \u001b[32m207.5/207.5 MB\u001b[0m \u001b[31m4.9 MB/s\u001b[0m eta \u001b[36m0:00:00\u001b[0m\n",
            "\u001b[?25hDownloading nvidia_nvjitlink_cu12-12.4.127-py3-none-manylinux2014_x86_64.whl (21.1 MB)\n",
            "\u001b[2K   \u001b[90m━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━\u001b[0m \u001b[32m21.1/21.1 MB\u001b[0m \u001b[31m96.9 MB/s\u001b[0m eta \u001b[36m0:00:00\u001b[0m\n",
            "\u001b[?25hInstalling collected packages: nvidia-nvjitlink-cu12, nvidia-curand-cu12, nvidia-cufft-cu12, nvidia-cuda-runtime-cu12, nvidia-cuda-nvrtc-cu12, nvidia-cuda-cupti-cu12, nvidia-cublas-cu12, neo4j, nvidia-cusparse-cu12, nvidia-cudnn-cu12, nvidia-cusolver-cu12\n",
            "  Attempting uninstall: nvidia-nvjitlink-cu12\n",
            "    Found existing installation: nvidia-nvjitlink-cu12 12.5.82\n",
            "    Uninstalling nvidia-nvjitlink-cu12-12.5.82:\n",
            "      Successfully uninstalled nvidia-nvjitlink-cu12-12.5.82\n",
            "  Attempting uninstall: nvidia-curand-cu12\n",
            "    Found existing installation: nvidia-curand-cu12 10.3.6.82\n",
            "    Uninstalling nvidia-curand-cu12-10.3.6.82:\n",
            "      Successfully uninstalled nvidia-curand-cu12-10.3.6.82\n",
            "  Attempting uninstall: nvidia-cufft-cu12\n",
            "    Found existing installation: nvidia-cufft-cu12 11.2.3.61\n",
            "    Uninstalling nvidia-cufft-cu12-11.2.3.61:\n",
            "      Successfully uninstalled nvidia-cufft-cu12-11.2.3.61\n",
            "  Attempting uninstall: nvidia-cuda-runtime-cu12\n",
            "    Found existing installation: nvidia-cuda-runtime-cu12 12.5.82\n",
            "    Uninstalling nvidia-cuda-runtime-cu12-12.5.82:\n",
            "      Successfully uninstalled nvidia-cuda-runtime-cu12-12.5.82\n",
            "  Attempting uninstall: nvidia-cuda-nvrtc-cu12\n",
            "    Found existing installation: nvidia-cuda-nvrtc-cu12 12.5.82\n",
            "    Uninstalling nvidia-cuda-nvrtc-cu12-12.5.82:\n",
            "      Successfully uninstalled nvidia-cuda-nvrtc-cu12-12.5.82\n",
            "  Attempting uninstall: nvidia-cuda-cupti-cu12\n",
            "    Found existing installation: nvidia-cuda-cupti-cu12 12.5.82\n",
            "    Uninstalling nvidia-cuda-cupti-cu12-12.5.82:\n",
            "      Successfully uninstalled nvidia-cuda-cupti-cu12-12.5.82\n",
            "  Attempting uninstall: nvidia-cublas-cu12\n",
            "    Found existing installation: nvidia-cublas-cu12 12.5.3.2\n",
            "    Uninstalling nvidia-cublas-cu12-12.5.3.2:\n",
            "      Successfully uninstalled nvidia-cublas-cu12-12.5.3.2\n",
            "  Attempting uninstall: nvidia-cusparse-cu12\n",
            "    Found existing installation: nvidia-cusparse-cu12 12.5.1.3\n",
            "    Uninstalling nvidia-cusparse-cu12-12.5.1.3:\n",
            "      Successfully uninstalled nvidia-cusparse-cu12-12.5.1.3\n",
            "  Attempting uninstall: nvidia-cudnn-cu12\n",
            "    Found existing installation: nvidia-cudnn-cu12 9.3.0.75\n",
            "    Uninstalling nvidia-cudnn-cu12-9.3.0.75:\n",
            "      Successfully uninstalled nvidia-cudnn-cu12-9.3.0.75\n",
            "  Attempting uninstall: nvidia-cusolver-cu12\n",
            "    Found existing installation: nvidia-cusolver-cu12 11.6.3.83\n",
            "    Uninstalling nvidia-cusolver-cu12-11.6.3.83:\n",
            "      Successfully uninstalled nvidia-cusolver-cu12-11.6.3.83\n",
            "Successfully installed neo4j-5.28.1 nvidia-cublas-cu12-12.4.5.8 nvidia-cuda-cupti-cu12-12.4.127 nvidia-cuda-nvrtc-cu12-12.4.127 nvidia-cuda-runtime-cu12-12.4.127 nvidia-cudnn-cu12-9.1.0.70 nvidia-cufft-cu12-11.2.1.3 nvidia-curand-cu12-10.3.5.147 nvidia-cusolver-cu12-11.6.1.9 nvidia-cusparse-cu12-12.3.1.170 nvidia-nvjitlink-cu12-12.4.127\n"
          ]
        }
      ],
      "source": [
        "!pip install neo4j transformers accelerate peft"
      ]
    },
    {
      "cell_type": "code",
      "source": [
        "\n",
        "from huggingface_hub import notebook_login\n",
        "notebook_login()\n"
      ],
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/",
          "height": 153,
          "referenced_widgets": [
            "6781946cd5254a7fa27318783f7bf753",
            "1699df7abe5e4b56ae78b7d8f3e121fb",
            "7db265a6de9b448a9a4fd2aaa8d78092",
            "11e4ac162ecc4926aba5ef85650821de",
            "dd4248ff241d4dd1a73ce0027e1fa88f",
            "effc1b6d4be44859bc4e6082ce9a46e2",
            "fe60b4b50eae4fda894b7c8dceb251e9",
            "b3fd6399977d4bd3b687bb70c4cc5c85",
            "13b14d02ffda41a4bd2b5869c1c4f511",
            "bc029b2acb08462593df3a044510d9ab",
            "5c086ecc2eaf491f9fca71163d602955",
            "ef2a22615523497b969bdc6bdb80333b",
            "1b918e855c764fc5999b15e26ea99a6d",
            "d0dbbc576b32430f926c8c83cf1b87cc",
            "df70bb5235004354ac89e0497853fc4b",
            "1a0282bb0bbc46b680ff449a60c676d2",
            "e62e3a7ae7c14c73a985423a597926d2",
            "7bba1d63b27f4d13b6c94a12ca47e724",
            "3cf21436c3da453fb7cbc1aa57eaf985",
            "6516e6c8fb754b61887facd07c649379",
            "4f495e2f2c7c45a1b324bc883d505b0c",
            "4e038836561c4c3f89fe4735ec0098e7",
            "0adfa1d32f984ce6bff9fe563cec6555",
            "487afec7da554c8dacdb899755e2c8ef",
            "d797bc2d9ced4361b56ec1febfdf95f9",
            "d441cb9dd13245aa9eb7693b0fcf897d"
          ]
        },
        "id": "LwjHxT0GxbWh",
        "outputId": "1ce07f39-4961-40b2-869c-b288ab61ce52"
      },
      "execution_count": null,
      "outputs": [
        {
          "output_type": "display_data",
          "data": {
            "text/plain": [
              "VBox(children=(HTML(value='<center> <img\\nsrc=https://huggingface.co/front/assets/huggingface_logo-noborder.sv…"
            ],
            "application/vnd.jupyter.widget-view+json": {
              "version_major": 2,
              "version_minor": 0,
              "model_id": "6781946cd5254a7fa27318783f7bf753"
            }
          },
          "metadata": {}
        },
        {
          "output_type": "stream",
          "name": "stderr",
          "text": [
            "/usr/local/lib/python3.11/dist-packages/huggingface_hub/utils/_auth.py:94: UserWarning: \n",
            "The secret `HF_TOKEN` does not exist in your Colab secrets.\n",
            "To authenticate with the Hugging Face Hub, create a token in your settings tab (https://huggingface.co/settings/tokens), set it as secret in your Google Colab and restart your session.\n",
            "You will be able to reuse this secret in all of your notebooks.\n",
            "Please note that authentication is recommended but still optional to access public models or datasets.\n",
            "  warnings.warn(\n"
          ]
        }
      ]
    },
    {
      "cell_type": "code",
      "source": [
        "import pandas as pd\n",
        "import os\n",
        "from peft import PeftModel, PeftConfig\n",
        "import torch\n",
        "from google.colab import files\n",
        "from transformers import (\n",
        "    AutoModelForCausalLM,\n",
        "    AutoTokenizer,\n",
        "    BitsAndBytesConfig,\n",
        ")\n",
        "# connect to google drive\n",
        "from google.colab import drive\n",
        "drive.mount('/content/drive')\n",
        "from google.colab import files\n"
      ],
      "metadata": {
        "id": "Qj1z3CQ4xbj0",
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "outputId": "0a8405fc-377e-4a8d-cc1a-2dca57ab6bc1"
      },
      "execution_count": null,
      "outputs": [
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "Mounted at /content/drive\n"
          ]
        }
      ]
    },
    {
      "cell_type": "code",
      "source": [
        "# load sample questions\n",
        "# Get the current script directory\n",
        "current_path = os.getcwd()\n",
        "print(\"Current Path:\", current_path)\n",
        "\n",
        "# Load questions CSV using the correct path\n",
        "csv_path = os.path.join(current_path, 'drive/MyDrive/cs696project/text2cypher_gemini.csv')\n",
        "print(\"CSV Path:\", csv_path)\n",
        "# Check if file exists before reading\n",
        "if os.path.exists(csv_path):\n",
        "    df = pd.read_csv(csv_path)\n",
        "    print(df.head())\n",
        "else:\n",
        "    print(f\"Error: File not found - {csv_path}\")"
      ],
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "id": "lW7Qkd4sysjr",
        "outputId": "515cc018-90dd-4d94-b761-bb895cd168d0"
      },
      "execution_count": null,
      "outputs": [
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "Current Path: /content\n",
            "CSV Path: /content/drive/MyDrive/cs696project/text2cypher_gemini.csv\n",
            "                                            question         database  \\\n",
            "0  Which movies from France have an IMDb rating h...  recommendations   \n",
            "1  What are the titles of the top 5 highest-gross...  recommendations   \n",
            "2  List the first 3 movies directed by Harold Lloyd.  recommendations   \n",
            "3  What genres are associated with the movie \"Toy...  recommendations   \n",
            "4  What is the average IMDb rating of movies rele...  recommendations   \n",
            "\n",
            "                                              output  \\\n",
            "0  <explanation>\\n1. We start by finding movies w...   \n",
            "1  <explanation>\\nThis Cypher query returns the t...   \n",
            "2  <explanation>\\n1. We need to find the director...   \n",
            "3  <explanation>\\nThis query starts by finding th...   \n",
            "4  <explanation>\\n1. **Find movies released in 19...   \n",
            "\n",
            "                       type  \\\n",
            "0  Simple Retrieval Queries   \n",
            "1  Simple Retrieval Queries   \n",
            "2  Simple Retrieval Queries   \n",
            "3  Simple Retrieval Queries   \n",
            "4  Simple Retrieval Queries   \n",
            "\n",
            "                                              cypher  \\\n",
            "0  MATCH (m:Movie)\\nWHERE \"France\" IN m.countries...   \n",
            "1  MATCH (m:Movie)\\nWITH m ORDER BY m.revenue DES...   \n",
            "2  MATCH (d:Director {name: \"Harold Lloyd\"})\\nMAT...   \n",
            "3  MATCH (m:Movie {title: 'Toy Story'})-[:IN_GENR...   \n",
            "4  MATCH (m:Movie {year: 1995})\\nWITH avg(m.imdbR...   \n",
            "\n",
            "                                         explanation  syntax_error  timeout  \\\n",
            "0  1. We start by finding movies with \"France\" in...         False    False   \n",
            "1                                                NaN         False    False   \n",
            "2  1. We need to find the director named \"Harold ...         False    False   \n",
            "3  This query starts by finding the movie with th...         False    False   \n",
            "4  1. **Find movies released in 1995:** We need t...         False    False   \n",
            "\n",
            "   returns_results  no_cypher  \n",
            "0             True      False  \n",
            "1             True      False  \n",
            "2             True      False  \n",
            "3             True      False  \n",
            "4             True      False  \n"
          ]
        }
      ]
    },
    {
      "cell_type": "code",
      "source": [
        "!nvidia-smi"
      ],
      "metadata": {
        "id": "7pey3vSOzWos"
      },
      "execution_count": null,
      "outputs": []
    },
    {
      "cell_type": "code",
      "source": [
        "from neo4j import GraphDatabase\n",
        "\n",
        "# URI examples: \"neo4j://localhost\", \"neo4j+s://xxx.databases.neo4j.io\"\n",
        "URI = \"neo4j+s://demo.neo4jlabs.com:7687\"\n",
        "AUTH = (\"recommendations\", \"recommendations\")\n",
        "\n",
        "with GraphDatabase.driver(URI, auth=AUTH) as driver:\n",
        "    driver.verify_connectivity()\n",
        "    print(\"Connection established.\")"
      ],
      "metadata": {
        "id": "CZXo_ZhgzWjC",
        "outputId": "350be12b-2c3f-4944-df85-05383c6a6a31",
        "colab": {
          "base_uri": "https://localhost:8080/"
        }
      },
      "execution_count": null,
      "outputs": [
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "Connection established.\n"
          ]
        }
      ]
    },
    {
      "cell_type": "code",
      "source": [
        "instruction = (\n",
        "    \"Generate Cypher statement to query a graph database. \"\n",
        "    \"Use only the provided relationship types and properties in the schema. \\n\"\n",
        "    \"Schema: {schema} \\n Question: {question}  \\n Cypher output: \"\n",
        ")\n",
        "\n",
        "def prepare_chat_prompt(question, schema) -> list[dict]:\n",
        "    chat = [\n",
        "        {\n",
        "            \"role\": \"user\",\n",
        "            \"content\": instruction.format(\n",
        "                schema=schema, question=question\n",
        "            ),\n",
        "        }\n",
        "    ]\n",
        "    return chat\n",
        "\n",
        "def _postprocess_output_cypher(output_cypher: str) -> str:\n",
        "    # Remove any explanation. E.g.  MATCH...\\n\\n**Explanation:**\\n\\n -> MATCH...\n",
        "    # Remove cypher indicator. E.g.```cypher\\nMATCH...```` --> MATCH...\n",
        "    # Note: Possible to have both:\n",
        "    #   E.g. ```cypher\\nMATCH...````\\n\\n**Explanation:**\\n\\n --> MATCH...\n",
        "    partition_by = \"**Explanation:**\"\n",
        "    output_cypher, _, _ = output_cypher.partition(partition_by)\n",
        "    output_cypher = output_cypher.strip(\"`\\n\")\n",
        "    output_cypher = output_cypher.lstrip(\"cypher\\n\")\n",
        "    output_cypher = output_cypher.strip(\"`\\n \")\n",
        "    return output_cypher"
      ],
      "metadata": {
        "id": "okAveiD7zWa4"
      },
      "execution_count": null,
      "outputs": []
    },
    {
      "cell_type": "code",
      "source": [
        "model_name = \"neo4j/text2cypher-gemma-2-9b-it-finetuned-2024v1\"\n",
        "# bnb_config = BitsAndBytesConfig(\n",
        "#     load_in_4bit=True,\n",
        "#     bnb_4bit_use_double_quant=True,\n",
        "#     bnb_4bit_quant_type=\"nf4\",\n",
        "#     bnb_4bit_compute_dtype=torch.bfloat16,\n",
        "# )\n",
        "tokenizer = AutoTokenizer.from_pretrained(model_name)\n",
        "model = AutoModelForCausalLM.from_pretrained(\n",
        "    model_name,\n",
        "    # quantization_config=bnb_config,\n",
        "    torch_dtype=torch.bfloat16,\n",
        "    attn_implementation=\"eager\",\n",
        "    low_cpu_mem_usage=True,\n",
        ").to(device=\"cuda:0\", non_blocking=True)\n"
      ],
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/",
          "height": 49,
          "referenced_widgets": [
            "1f2cf7a26d5b467793ed0f5ee3a9d947",
            "a0e8f15c35674381b848c2817905e4d4",
            "4a9e4887246d4839b6a7f007aa5cc09d",
            "f24f51e7c26047d785fb10b294a8d92b",
            "ded19fcc6fbe442d892862f9e28ea902",
            "f0e56132cee14008b6231f0c8cc6f2cb",
            "31d8a8d993784f00bff2683413a61094",
            "725b62c5001747beba27202158c391ca",
            "1c47834504dc46258890d6634f9f18b9",
            "7ab96cd8aab74457b22a7e7c850ac423",
            "e15a961cf32440ba91bf60983c1c6485"
          ]
        },
        "id": "rqacQvCe2sre",
        "outputId": "c3f9c007-12c1-4963-95c2-c6611159efb1"
      },
      "execution_count": null,
      "outputs": [
        {
          "output_type": "display_data",
          "data": {
            "text/plain": [
              "Loading checkpoint shards:   0%|          | 0/4 [00:00<?, ?it/s]"
            ],
            "application/vnd.jupyter.widget-view+json": {
              "version_major": 2,
              "version_minor": 0,
              "model_id": "1f2cf7a26d5b467793ed0f5ee3a9d947"
            }
          },
          "metadata": {}
        }
      ]
    },
    {
      "cell_type": "code",
      "source": [
        "# sample question\n",
        "question = \"What are the movies of Tom Hanks?\"\n",
        "# schema = \"(:Actor)-[:ActedIn]->(:Movie)\" # Check the NOTE below on creating your own schemas\n",
        "schema = \"\"\n",
        "new_message = prepare_chat_prompt(question=question, schema=schema)\n",
        "prompt = tokenizer.apply_chat_template(new_message, add_generation_prompt=True, tokenize=False)\n",
        "inputs = tokenizer(prompt, return_tensors=\"pt\", padding=True)\n",
        "\n",
        "# Any other parameters\n",
        "model_generate_parameters = {\n",
        "    \"top_p\": 0.9,\n",
        "    \"temperature\": 0.1,\n",
        "    \"max_new_tokens\": 512,\n",
        "    \"do_sample\": True,\n",
        "    \"pad_token_id\": tokenizer.eos_token_id,\n",
        "}\n",
        "\n",
        "inputs.to(model.device)\n",
        "model.eval()\n",
        "with torch.no_grad():\n",
        "    tokens = model.generate(**inputs, **model_generate_parameters)\n",
        "    tokens = tokens[:, inputs.input_ids.shape[1] :]\n",
        "    raw_outputs = tokenizer.batch_decode(tokens, skip_special_tokens=True)\n",
        "    outputs = [_postprocess_output_cypher(output) for output in raw_outputs]\n",
        "\n",
        "print(outputs)"
      ],
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "id": "SFCJFY163JSC",
        "outputId": "86401c6b-0279-4b56-90f5-d50021c180e9"
      },
      "execution_count": null,
      "outputs": [
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "['MATCH (a:Actor {Name: \"Tom Hanks\"})-[:ACTED_IN]->(m:Movie) RETURN m.Title AS MovieTitle']\n"
          ]
        }
      ]
    },
    {
      "cell_type": "code",
      "source": [
        "rec_df = df[(df['database'] == 'recommendations') & (df['returns_results'] == True)]\n",
        "sample = 20\n",
        "# Randomly sample 10 elements (if available)\n",
        "sampled_df = rec_df.sample(n=sample, random_state=42)\n"
      ],
      "metadata": {
        "id": "q3pS_DT0DRlD"
      },
      "execution_count": null,
      "outputs": []
    },
    {
      "cell_type": "code",
      "source": [
        "\n",
        "model_generate_parameters = {\n",
        "    \"top_p\": 0.9,\n",
        "    \"temperature\": 0.1,\n",
        "    \"max_new_tokens\": 512,\n",
        "    \"do_sample\": True,\n",
        "    \"pad_token_id\": tokenizer.eos_token_id,\n",
        "}\n",
        "\n",
        "cypher_outputs = []  # generated cypher output\n",
        "execution_errors = []  # executable?\n",
        "\n",
        "for i in range(sample):\n",
        "    question = sampled_df.iloc[i]['question']\n",
        "    print(question)\n",
        "    new_message = prepare_chat_prompt(question=question, schema='')\n",
        "    prompt = tokenizer.apply_chat_template(new_message, add_generation_prompt=True, tokenize=False)\n",
        "    inputs = tokenizer(prompt, return_tensors=\"pt\", padding=True)\n",
        "    inputs.to(model.device)\n",
        "    model.eval()\n",
        "    with torch.no_grad():\n",
        "        tokens = model.generate(**inputs, **model_generate_parameters)\n",
        "        tokens = tokens[:, inputs.input_ids.shape[1] :]\n",
        "        raw_outputs = tokenizer.batch_decode(tokens, skip_special_tokens=True)\n",
        "        output = [_postprocess_output_cypher(output) for output in raw_outputs]\n",
        "        cypher_outputs.append(output[0])  # record cypher output\n",
        "        ###########################  execute it on the database\n",
        "        try:\n",
        "            records, summary, keys = driver.execute_query(\n",
        "            cypher_outputs[i],  # Fixed variable name `g.name` → `p.name`\n",
        "            database_=\"recommendations\",\n",
        "            )\n",
        "\n",
        "            # # Loop through results and print as dictionary\n",
        "            # for record in records:\n",
        "            #     print(record.data())\n",
        "\n",
        "            # # Summary information\n",
        "            # print(\"The query `{query}` returned {records_count} records in {time} ms.\".format(\n",
        "            #     query=summary.query, records_count=len(records),\n",
        "            #     time=summary.result_available_after\n",
        "            # ))\n",
        "            execution_errors.append(False)\n",
        "        except Exception as e:\n",
        "            print(f\"An error occurred: {e}\")\n",
        "            execution_errors.append(True)\n",
        "            continue  # Skip to the next iteration if an error occurs\n",
        "      ###########################\n",
        "print(cypher_outputs)"
      ],
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "id": "o4XCb55OGyUb",
        "outputId": "dbc53f68-abdf-476a-981c-5191bebe2979"
      },
      "execution_count": null,
      "outputs": [
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "What is the average IMDB rating of movies based on books?\n"
          ]
        },
        {
          "output_type": "stream",
          "name": "stderr",
          "text": [
            "<ipython-input-63-0201bd9e418b>:28: DeprecationWarning: Using a driver after it has been closed is deprecated. Future versions of the driver will raise an error.\n",
            "  records, summary, keys = driver.execute_query(\n"
          ]
        },
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "An error occurred: {code: Neo.ClientError.Statement.SyntaxError} {message: Variable `rating` not defined (line 1, column 73 (offset: 72))\n",
            "\"MATCH (m:Movie)-[:BASED_ON]->(b:Book) WITH m.IMDB_RATING AS rating, avg(rating) AS average_rating RETURN average_rating\"\n",
            "                                                                         ^}\n",
            "List the movies released in the same year as \"Boxtrolls, The\".\n"
          ]
        },
        {
          "output_type": "stream",
          "name": "stderr",
          "text": [
            "WARNING:neo4j.notifications:Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.UnknownRelationshipTypeWarning} {category: UNRECOGNIZED} {title: The provided relationship type is not in the database.} {description: One of the relationship types in your query is not available in the database, make sure you didn't misspell it or that the label is available when you run this statement in your application (the missing relationship type is: RELEASED_IN)} {position: line: 1, column: 20, offset: 19} for query: \"MATCH (m1:Movie)-[:RELEASED_IN]->(y1:Year)<-[:RELEASED_IN]-(m2:Movie) WHERE m1.title = 'Boxtrolls, The' RETURN m2.title\"\n",
            "WARNING:neo4j.notifications:Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.UnknownRelationshipTypeWarning} {category: UNRECOGNIZED} {title: The provided relationship type is not in the database.} {description: One of the relationship types in your query is not available in the database, make sure you didn't misspell it or that the label is available when you run this statement in your application (the missing relationship type is: RELEASED_IN)} {position: line: 1, column: 47, offset: 46} for query: \"MATCH (m1:Movie)-[:RELEASED_IN]->(y1:Year)<-[:RELEASED_IN]-(m2:Movie) WHERE m1.title = 'Boxtrolls, The' RETURN m2.title\"\n",
            "WARNING:neo4j.notifications:Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.UnknownLabelWarning} {category: UNRECOGNIZED} {title: The provided label is not in the database.} {description: One of the labels in your query is not available in the database, make sure you didn't misspell it or that the label is available when you run this statement in your application (the missing label name is: Year)} {position: line: 1, column: 38, offset: 37} for query: \"MATCH (m1:Movie)-[:RELEASED_IN]->(y1:Year)<-[:RELEASED_IN]-(m2:Movie) WHERE m1.title = 'Boxtrolls, The' RETURN m2.title\"\n"
          ]
        },
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "List the actors who have acted in both 'Comedy' and 'Drama' movies.\n"
          ]
        },
        {
          "output_type": "stream",
          "name": "stderr",
          "text": [
            "WARNING:neo4j.notifications:Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.UnknownPropertyKeyWarning} {category: UNRECOGNIZED} {title: The provided property key is not in the database} {description: One of the property names in your query is not available in the database, make sure you didn't misspell it or that the label is available when you run this statement in your application (the missing property name is: Genre)} {position: line: 1, column: 48, offset: 47} for query: \"MATCH (a:Actor)-[:ACTED_IN]->(m:Movie) WHERE m.Genre IN ['Comedy', 'Drama'] RETURN DISTINCT a.Name\"\n",
            "WARNING:neo4j.notifications:Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.UnknownPropertyKeyWarning} {category: UNRECOGNIZED} {title: The provided property key is not in the database} {description: One of the property names in your query is not available in the database, make sure you didn't misspell it or that the label is available when you run this statement in your application (the missing property name is: Name)} {position: line: 1, column: 95, offset: 94} for query: \"MATCH (a:Actor)-[:ACTED_IN]->(m:Movie) WHERE m.Genre IN ['Comedy', 'Drama'] RETURN DISTINCT a.Name\"\n"
          ]
        },
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "Which director has the highest ratio of box office revenue to budget?\n",
            "An error occurred: {code: Neo.ClientError.Statement.ArithmeticError} {message: / by zero}\n",
            "List the actors who have acted in both \"Boxtrolls, The\" and \"Open Season\".\n"
          ]
        },
        {
          "output_type": "stream",
          "name": "stderr",
          "text": [
            "WARNING:neo4j.notifications:Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.UnknownPropertyKeyWarning} {category: UNRECOGNIZED} {title: The provided property key is not in the database} {description: One of the property names in your query is not available in the database, make sure you didn't misspell it or that the label is available when you run this statement in your application (the missing property name is: Title)} {position: line: 1, column: 48, offset: 47} for query: \"MATCH (a:Actor)-[:ACTED_IN]->(m:Movie) WHERE m.Title IN ['Boxtrolls, The', 'Open Season'] RETURN a.Name AS ActorName, m.Title AS MovieTitle\"\n",
            "WARNING:neo4j.notifications:Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.UnknownPropertyKeyWarning} {category: UNRECOGNIZED} {title: The provided property key is not in the database} {description: One of the property names in your query is not available in the database, make sure you didn't misspell it or that the label is available when you run this statement in your application (the missing property name is: Name)} {position: line: 1, column: 100, offset: 99} for query: \"MATCH (a:Actor)-[:ACTED_IN]->(m:Movie) WHERE m.Title IN ['Boxtrolls, The', 'Open Season'] RETURN a.Name AS ActorName, m.Title AS MovieTitle\"\n",
            "WARNING:neo4j.notifications:Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.UnknownPropertyKeyWarning} {category: UNRECOGNIZED} {title: The provided property key is not in the database} {description: One of the property names in your query is not available in the database, make sure you didn't misspell it or that the label is available when you run this statement in your application (the missing property name is: Title)} {position: line: 1, column: 121, offset: 120} for query: \"MATCH (a:Actor)-[:ACTED_IN]->(m:Movie) WHERE m.Title IN ['Boxtrolls, The', 'Open Season'] RETURN a.Name AS ActorName, m.Title AS MovieTitle\"\n"
          ]
        },
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "List the movies released in the year the user \"Omar Huffman\" was born.\n"
          ]
        },
        {
          "output_type": "stream",
          "name": "stderr",
          "text": [
            "WARNING:neo4j.notifications:Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.UnknownRelationshipTypeWarning} {category: UNRECOGNIZED} {title: The provided relationship type is not in the database.} {description: One of the relationship types in your query is not available in the database, make sure you didn't misspell it or that the label is available when you run this statement in your application (the missing relationship type is: HAS_BIRTH_YEAR)} {position: line: 1, column: 41, offset: 40} for query: 'MATCH (u:User {name: \"Omar Huffman\"})-[:HAS_BIRTH_YEAR]->(b:BirthYear) MATCH (m:Movie)-[:RELEASED_IN]->(b) RETURN m.title AS MovieTitle, b.year AS BirthYear'\n",
            "WARNING:neo4j.notifications:Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.UnknownLabelWarning} {category: UNRECOGNIZED} {title: The provided label is not in the database.} {description: One of the labels in your query is not available in the database, make sure you didn't misspell it or that the label is available when you run this statement in your application (the missing label name is: BirthYear)} {position: line: 1, column: 61, offset: 60} for query: 'MATCH (u:User {name: \"Omar Huffman\"})-[:HAS_BIRTH_YEAR]->(b:BirthYear) MATCH (m:Movie)-[:RELEASED_IN]->(b) RETURN m.title AS MovieTitle, b.year AS BirthYear'\n",
            "WARNING:neo4j.notifications:Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.UnknownRelationshipTypeWarning} {category: UNRECOGNIZED} {title: The provided relationship type is not in the database.} {description: One of the relationship types in your query is not available in the database, make sure you didn't misspell it or that the label is available when you run this statement in your application (the missing relationship type is: RELEASED_IN)} {position: line: 1, column: 90, offset: 89} for query: 'MATCH (u:User {name: \"Omar Huffman\"})-[:HAS_BIRTH_YEAR]->(b:BirthYear) MATCH (m:Movie)-[:RELEASED_IN]->(b) RETURN m.title AS MovieTitle, b.year AS BirthYear'\n"
          ]
        },
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "What is the average runtime of movies released in the last 10 years?\n",
            "An error occurred: {code: Neo.ClientError.Statement.SyntaxError} {message: Type mismatch: expected Duration but was DateTime (line 1, column 54 (offset: 53))\n",
            "\"MATCH (m:Movie) WHERE m.releaseDate >= date('now') - datetime('10 years') RETURN avg(m.runtime) AS average_runtime\"\n",
            "                                                      ^}\n",
            "What are the titles of the top 3 movies with the highest IMDb rating?\n",
            "What is the name of the director who has directed the most movies in the \"Action\" genre?\n"
          ]
        },
        {
          "output_type": "stream",
          "name": "stderr",
          "text": [
            "WARNING:neo4j.notifications:Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.UnknownPropertyKeyWarning} {category: UNRECOGNIZED} {title: The provided property key is not in the database} {description: One of the property names in your query is not available in the database, make sure you didn't misspell it or that the label is available when you run this statement in your application (the missing property name is: Genre)} {position: line: 1, column: 51, offset: 50} for query: \"MATCH (d:Director)-[:DIRECTED]->(m:Movie) WHERE m.Genre = 'Action' WITH d, count(m) AS movieCount RETURN d.Name AS DirectorName, movieCount ORDER BY movieCount DESC LIMIT 1\"\n",
            "WARNING:neo4j.notifications:Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.UnknownPropertyKeyWarning} {category: UNRECOGNIZED} {title: The provided property key is not in the database} {description: One of the property names in your query is not available in the database, make sure you didn't misspell it or that the label is available when you run this statement in your application (the missing property name is: Name)} {position: line: 1, column: 108, offset: 107} for query: \"MATCH (d:Director)-[:DIRECTED]->(m:Movie) WHERE m.Genre = 'Action' WITH d, count(m) AS movieCount RETURN d.Name AS DirectorName, movieCount ORDER BY movieCount DESC LIMIT 1\"\n"
          ]
        },
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "What is the name of the oldest actor in the database who is still alive?\n",
            "What is the name of the actor born in Minneapolis, Minnesota, USA, who starred in \"Two Night Stand\"?\n"
          ]
        },
        {
          "output_type": "stream",
          "name": "stderr",
          "text": [
            "WARNING:neo4j.notifications:Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.UnknownRelationshipTypeWarning} {category: UNRECOGNIZED} {title: The provided relationship type is not in the database.} {description: One of the relationship types in your query is not available in the database, make sure you didn't misspell it or that the label is available when you run this statement in your application (the missing relationship type is: BORN_IN)} {position: line: 1, column: 19, offset: 18} for query: 'MATCH (a:Actor)-[:BORN_IN]->(loc:Location {name: \"Minneapolis, Minnesota, USA\"})-[:IN_MOVIE]->(m:Movie {title: \"Two Night Stand\"}) RETURN a.name AS ActorName'\n",
            "WARNING:neo4j.notifications:Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.UnknownRelationshipTypeWarning} {category: UNRECOGNIZED} {title: The provided relationship type is not in the database.} {description: One of the relationship types in your query is not available in the database, make sure you didn't misspell it or that the label is available when you run this statement in your application (the missing relationship type is: IN_MOVIE)} {position: line: 1, column: 84, offset: 83} for query: 'MATCH (a:Actor)-[:BORN_IN]->(loc:Location {name: \"Minneapolis, Minnesota, USA\"})-[:IN_MOVIE]->(m:Movie {title: \"Two Night Stand\"}) RETURN a.name AS ActorName'\n",
            "WARNING:neo4j.notifications:Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.UnknownLabelWarning} {category: UNRECOGNIZED} {title: The provided label is not in the database.} {description: One of the labels in your query is not available in the database, make sure you didn't misspell it or that the label is available when you run this statement in your application (the missing label name is: Location)} {position: line: 1, column: 34, offset: 33} for query: 'MATCH (a:Actor)-[:BORN_IN]->(loc:Location {name: \"Minneapolis, Minnesota, USA\"})-[:IN_MOVIE]->(m:Movie {title: \"Two Night Stand\"}) RETURN a.name AS ActorName'\n"
          ]
        },
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "List the movies released in the same year as the movie with the highest IMDb rating.\n",
            "List the movies that have been nominated for an Oscar for Best Picture and have a budget greater than 150 million.\n"
          ]
        },
        {
          "output_type": "stream",
          "name": "stderr",
          "text": [
            "WARNING:neo4j.notifications:Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.UnknownRelationshipTypeWarning} {category: UNRECOGNIZED} {title: The provided relationship type is not in the database.} {description: One of the relationship types in your query is not available in the database, make sure you didn't misspell it or that the label is available when you run this statement in your application (the missing relationship type is: NOMINATED_FOR)} {position: line: 1, column: 19, offset: 18} for query: \"MATCH (m:Movie)-[:NOMINATED_FOR]->(o:Award) WHERE o.Name = 'Best Picture' AND m.Budget > 150.0E6 RETURN m.Title\"\n",
            "WARNING:neo4j.notifications:Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.UnknownLabelWarning} {category: UNRECOGNIZED} {title: The provided label is not in the database.} {description: One of the labels in your query is not available in the database, make sure you didn't misspell it or that the label is available when you run this statement in your application (the missing label name is: Award)} {position: line: 1, column: 38, offset: 37} for query: \"MATCH (m:Movie)-[:NOMINATED_FOR]->(o:Award) WHERE o.Name = 'Best Picture' AND m.Budget > 150.0E6 RETURN m.Title\"\n",
            "WARNING:neo4j.notifications:Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.UnknownPropertyKeyWarning} {category: UNRECOGNIZED} {title: The provided property key is not in the database} {description: One of the property names in your query is not available in the database, make sure you didn't misspell it or that the label is available when you run this statement in your application (the missing property name is: Title)} {position: line: 1, column: 107, offset: 106} for query: \"MATCH (m:Movie)-[:NOMINATED_FOR]->(o:Award) WHERE o.Name = 'Best Picture' AND m.Budget > 150.0E6 RETURN m.Title\"\n",
            "WARNING:neo4j.notifications:Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.UnknownPropertyKeyWarning} {category: UNRECOGNIZED} {title: The provided property key is not in the database} {description: One of the property names in your query is not available in the database, make sure you didn't misspell it or that the label is available when you run this statement in your application (the missing property name is: Budget)} {position: line: 1, column: 81, offset: 80} for query: \"MATCH (m:Movie)-[:NOMINATED_FOR]->(o:Award) WHERE o.Name = 'Best Picture' AND m.Budget > 150.0E6 RETURN m.Title\"\n",
            "WARNING:neo4j.notifications:Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.UnknownPropertyKeyWarning} {category: UNRECOGNIZED} {title: The provided property key is not in the database} {description: One of the property names in your query is not available in the database, make sure you didn't misspell it or that the label is available when you run this statement in your application (the missing property name is: Name)} {position: line: 1, column: 53, offset: 52} for query: \"MATCH (m:Movie)-[:NOMINATED_FOR]->(o:Award) WHERE o.Name = 'Best Picture' AND m.Budget > 150.0E6 RETURN m.Title\"\n"
          ]
        },
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "What is the average IMDb rating of movies released in the 21st century?\n",
            "List the names of all actors who have won both an Oscar and a Golden Globe award.\n"
          ]
        },
        {
          "output_type": "stream",
          "name": "stderr",
          "text": [
            "WARNING:neo4j.notifications:Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.UnknownLabelWarning} {category: UNRECOGNIZED} {title: The provided label is not in the database.} {description: One of the labels in your query is not available in the database, make sure you didn't misspell it or that the label is available when you run this statement in your application (the missing label name is: GoldenGlobe)} {position: line: 1, column: 53, offset: 52} for query: 'MATCH (a:Actor)-[:HAS_WON]->(o:Oscar)<-[:HAS_WON]-(:GoldenGlobe) RETURN a.Name AS ActorName'\n",
            "WARNING:neo4j.notifications:Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.UnknownRelationshipTypeWarning} {category: UNRECOGNIZED} {title: The provided relationship type is not in the database.} {description: One of the relationship types in your query is not available in the database, make sure you didn't misspell it or that the label is available when you run this statement in your application (the missing relationship type is: HAS_WON)} {position: line: 1, column: 42, offset: 41} for query: 'MATCH (a:Actor)-[:HAS_WON]->(o:Oscar)<-[:HAS_WON]-(:GoldenGlobe) RETURN a.Name AS ActorName'\n",
            "WARNING:neo4j.notifications:Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.UnknownLabelWarning} {category: UNRECOGNIZED} {title: The provided label is not in the database.} {description: One of the labels in your query is not available in the database, make sure you didn't misspell it or that the label is available when you run this statement in your application (the missing label name is: Oscar)} {position: line: 1, column: 32, offset: 31} for query: 'MATCH (a:Actor)-[:HAS_WON]->(o:Oscar)<-[:HAS_WON]-(:GoldenGlobe) RETURN a.Name AS ActorName'\n",
            "WARNING:neo4j.notifications:Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.UnknownRelationshipTypeWarning} {category: UNRECOGNIZED} {title: The provided relationship type is not in the database.} {description: One of the relationship types in your query is not available in the database, make sure you didn't misspell it or that the label is available when you run this statement in your application (the missing relationship type is: HAS_WON)} {position: line: 1, column: 19, offset: 18} for query: 'MATCH (a:Actor)-[:HAS_WON]->(o:Oscar)<-[:HAS_WON]-(:GoldenGlobe) RETURN a.Name AS ActorName'\n",
            "WARNING:neo4j.notifications:Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.UnknownPropertyKeyWarning} {category: UNRECOGNIZED} {title: The provided property key is not in the database} {description: One of the property names in your query is not available in the database, make sure you didn't misspell it or that the label is available when you run this statement in your application (the missing property name is: Name)} {position: line: 1, column: 75, offset: 74} for query: 'MATCH (a:Actor)-[:HAS_WON]->(o:Oscar)<-[:HAS_WON]-(:GoldenGlobe) RETURN a.Name AS ActorName'\n"
          ]
        },
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "What is the average rating given by users to movies in the \"Adventure\" genre?\n",
            "What is the total revenue of movies released by Warner Bros. Pictures?\n"
          ]
        },
        {
          "output_type": "stream",
          "name": "stderr",
          "text": [
            "WARNING:neo4j.notifications:Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.UnknownPropertyKeyWarning} {category: UNRECOGNIZED} {title: The provided property key is not in the database} {description: One of the property names in your query is not available in the database, make sure you didn't misspell it or that the label is available when you run this statement in your application (the missing property name is: released_by)} {position: line: 1, column: 71, offset: 70} for query: \"MATCH (m:Movie)-[:ACTED_IN]->(a:Actor)-[:ACTED_IN]->(o:Movie) WHERE m.released_by = 'Warner Bros. Pictures' RETURN sum(m.revenue) AS total_revenue\"\n"
          ]
        },
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "What is the most common language among movies with a runtime longer than 3 hours?\n"
          ]
        },
        {
          "output_type": "stream",
          "name": "stderr",
          "text": [
            "WARNING:neo4j.notifications:Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.UnknownRelationshipTypeWarning} {category: UNRECOGNIZED} {title: The provided relationship type is not in the database.} {description: One of the relationship types in your query is not available in the database, make sure you didn't misspell it or that the label is available when you run this statement in your application (the missing relationship type is: IN_LANGUAGE)} {position: line: 1, column: 56, offset: 55} for query: 'MATCH (m:Movie) WHERE m.runtime > 3 WITH m MATCH (m)-[:IN_LANGUAGE]->(l:Language) RETURN l.name AS language, count(m) AS count ORDER BY count DESC LIMIT 1'\n",
            "WARNING:neo4j.notifications:Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.UnknownLabelWarning} {category: UNRECOGNIZED} {title: The provided label is not in the database.} {description: One of the labels in your query is not available in the database, make sure you didn't misspell it or that the label is available when you run this statement in your application (the missing label name is: Language)} {position: line: 1, column: 73, offset: 72} for query: 'MATCH (m:Movie) WHERE m.runtime > 3 WITH m MATCH (m)-[:IN_LANGUAGE]->(l:Language) RETURN l.name AS language, count(m) AS count ORDER BY count DESC LIMIT 1'\n"
          ]
        },
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "List all the movies that have been adapted into TV shows.\n"
          ]
        },
        {
          "output_type": "stream",
          "name": "stderr",
          "text": [
            "WARNING:neo4j.notifications:Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.UnknownRelationshipTypeWarning} {category: UNRECOGNIZED} {title: The provided relationship type is not in the database.} {description: One of the relationship types in your query is not available in the database, make sure you didn't misspell it or that the label is available when you run this statement in your application (the missing relationship type is: ADAPTED_FROM)} {position: line: 1, column: 21, offset: 20} for query: 'MATCH (m:Movie) -[r:ADAPTED_FROM]->(tv:TVShow) RETURN m.Title AS MovieTitle, tv.Title AS TVShowTitle'\n",
            "WARNING:neo4j.notifications:Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.UnknownLabelWarning} {category: UNRECOGNIZED} {title: The provided label is not in the database.} {description: One of the labels in your query is not available in the database, make sure you didn't misspell it or that the label is available when you run this statement in your application (the missing label name is: TVShow)} {position: line: 1, column: 40, offset: 39} for query: 'MATCH (m:Movie) -[r:ADAPTED_FROM]->(tv:TVShow) RETURN m.Title AS MovieTitle, tv.Title AS TVShowTitle'\n",
            "WARNING:neo4j.notifications:Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.UnknownPropertyKeyWarning} {category: UNRECOGNIZED} {title: The provided property key is not in the database} {description: One of the property names in your query is not available in the database, make sure you didn't misspell it or that the label is available when you run this statement in your application (the missing property name is: Title)} {position: line: 1, column: 57, offset: 56} for query: 'MATCH (m:Movie) -[r:ADAPTED_FROM]->(tv:TVShow) RETURN m.Title AS MovieTitle, tv.Title AS TVShowTitle'\n",
            "WARNING:neo4j.notifications:Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.UnknownPropertyKeyWarning} {category: UNRECOGNIZED} {title: The provided property key is not in the database} {description: One of the property names in your query is not available in the database, make sure you didn't misspell it or that the label is available when you run this statement in your application (the missing property name is: Title)} {position: line: 1, column: 81, offset: 80} for query: 'MATCH (m:Movie) -[r:ADAPTED_FROM]->(tv:TVShow) RETURN m.Title AS MovieTitle, tv.Title AS TVShowTitle'\n"
          ]
        },
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "List all movies that have a budget greater than 200 million and a runtime less than 2 hours.\n",
            "['MATCH (m:Movie)-[:BASED_ON]->(b:Book) WITH m.IMDB_RATING AS rating, avg(rating) AS average_rating RETURN average_rating', \"MATCH (m1:Movie)-[:RELEASED_IN]->(y1:Year)<-[:RELEASED_IN]-(m2:Movie) WHERE m1.title = 'Boxtrolls, The' RETURN m2.title\", \"MATCH (a:Actor)-[:ACTED_IN]->(m:Movie) WHERE m.Genre IN ['Comedy', 'Drama'] RETURN DISTINCT a.Name\", 'MATCH (d:Director) -[r:DIRECTED]->(m:Movie) WITH d, sum(r.BoxOfficeRevenue) AS totalRevenue, sum(r.Budget) AS totalBudget RETURN d.Name AS Director, totalRevenue / totalBudget AS RevenueRatio ORDER BY RevenueRatio DESC LIMIT 1', \"MATCH (a:Actor)-[:ACTED_IN]->(m:Movie) WHERE m.Title IN ['Boxtrolls, The', 'Open Season'] RETURN a.Name AS ActorName, m.Title AS MovieTitle\", 'MATCH (u:User {name: \"Omar Huffman\"})-[:HAS_BIRTH_YEAR]->(b:BirthYear) MATCH (m:Movie)-[:RELEASED_IN]->(b) RETURN m.title AS MovieTitle, b.year AS BirthYear', \"MATCH (m:Movie) WHERE m.releaseDate >= date('now') - datetime('10 years') RETURN avg(m.runtime) AS average_runtime\", 'MATCH (m:Movie) RETURN m.title, m.imdbRating ORDER BY m.imdbRating DESC LIMIT 3', \"MATCH (d:Director)-[:DIRECTED]->(m:Movie) WHERE m.Genre = 'Action' WITH d, count(m) AS movieCount RETURN d.Name AS DirectorName, movieCount ORDER BY movieCount DESC LIMIT 1\", \"MATCH (a:Actor)-[:ACTED_IN]->(m:Movie) WHERE m.title = 'The Matrix' RETURN a.name AS ActorName ORDER BY a.born DESC LIMIT 1\", 'MATCH (a:Actor)-[:BORN_IN]->(loc:Location {name: \"Minneapolis, Minnesota, USA\"})-[:IN_MOVIE]->(m:Movie {title: \"Two Night Stand\"}) RETURN a.name AS ActorName', \"MATCH (m1:Movie) MATCH (m2:Movie) WHERE m1.title = 'The Dark Knight' AND m2.title <> m1.title RETURN m2.title\", \"MATCH (m:Movie)-[:NOMINATED_FOR]->(o:Award) WHERE o.Name = 'Best Picture' AND m.Budget > 150.0E6 RETURN m.Title\", 'MATCH (m:Movie) WHERE m.released >= 2000 WITH avg(m.imdbRating) AS average_rating RETURN average_rating', 'MATCH (a:Actor)-[:HAS_WON]->(o:Oscar)<-[:HAS_WON]-(:GoldenGlobe) RETURN a.Name AS ActorName', 'MATCH (m:Movie)-[:IN_GENRE]->(g:Genre {name: \"Adventure\"})-[:RATED]->(u:User) RETURN avg(u.rating) AS average_rating', \"MATCH (m:Movie)-[:ACTED_IN]->(a:Actor)-[:ACTED_IN]->(o:Movie) WHERE m.released_by = 'Warner Bros. Pictures' RETURN sum(m.revenue) AS total_revenue\", 'MATCH (m:Movie) WHERE m.runtime > 3 WITH m MATCH (m)-[:IN_LANGUAGE]->(l:Language) RETURN l.name AS language, count(m) AS count ORDER BY count DESC LIMIT 1', 'MATCH (m:Movie) -[r:ADAPTED_FROM]->(tv:TVShow) RETURN m.Title AS MovieTitle, tv.Title AS TVShowTitle', 'MATCH (m:Movie) WHERE m.budget > 200 AND m.runtime < 120 RETURN m.title AS MovieTitle, m.budget AS Budget, m.runtime AS Runtime']\n"
          ]
        }
      ]
    },
    {
      "cell_type": "code",
      "source": [
        "sampled_df['finetuned_results'] = cypher_outputs\n",
        "sampled_df['execution_errors'] = execution_errors\n",
        "sampled_df['execution_errors'].value_counts()\n",
        "# csv_filename = \"10_Samples.csv\"\n",
        "# sampled_df.to_csv(csv_filename, index=False)  # Save without the index\n",
        "\n",
        "# # Download the file\n",
        "# files.download(csv_filename)"
      ],
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/",
          "height": 178
        },
        "id": "muoJ9tETMe9X",
        "outputId": "cb62fbf8-560d-4735-aace-1061509a8b1d"
      },
      "execution_count": null,
      "outputs": [
        {
          "output_type": "execute_result",
          "data": {
            "text/plain": [
              "execution_errors\n",
              "False    17\n",
              "True      3\n",
              "Name: count, dtype: int64"
            ],
            "text/html": [
              "<div>\n",
              "<style scoped>\n",
              "    .dataframe tbody tr th:only-of-type {\n",
              "        vertical-align: middle;\n",
              "    }\n",
              "\n",
              "    .dataframe tbody tr th {\n",
              "        vertical-align: top;\n",
              "    }\n",
              "\n",
              "    .dataframe thead th {\n",
              "        text-align: right;\n",
              "    }\n",
              "</style>\n",
              "<table border=\"1\" class=\"dataframe\">\n",
              "  <thead>\n",
              "    <tr style=\"text-align: right;\">\n",
              "      <th></th>\n",
              "      <th>count</th>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>execution_errors</th>\n",
              "      <th></th>\n",
              "    </tr>\n",
              "  </thead>\n",
              "  <tbody>\n",
              "    <tr>\n",
              "      <th>False</th>\n",
              "      <td>17</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>True</th>\n",
              "      <td>3</td>\n",
              "    </tr>\n",
              "  </tbody>\n",
              "</table>\n",
              "</div><br><label><b>dtype:</b> int64</label>"
            ]
          },
          "metadata": {},
          "execution_count": 65
        }
      ]
    },
    {
      "cell_type": "code",
      "source": [
        "# neo4j official\n",
        "current_path = os.getcwd()\n",
        "print(\"Current Path:\", current_path)\n",
        "# splits = {'train': 'data/train-00000-of-00001.parquet', 'test': 'data/test-00000-of-00001.parquet'}\n",
        "df = pd.read_parquet(path=f'{current_path}/drive/MyDrive/cs696project/train-00000-of-00001.parquet', engine=\"pyarrow\")\n",
        "df.head()"
      ],
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/",
          "height": 293
        },
        "id": "w5ZQ5mVdHxbV",
        "outputId": "de5e0fcf-5a1b-45b7-edfe-9001dd68fb26"
      },
      "execution_count": null,
      "outputs": [
        {
          "output_type": "execute_result",
          "data": {
            "text/plain": [
              "                                            question  \\\n",
              "0  Which 3 countries have the most entities linke...   \n",
              "1  What are the names of the first 3 organization...   \n",
              "2  List the names of the games played by streams ...   \n",
              "3  For each Article find its abstract and the cou...   \n",
              "4  Find the Author for which first_name starts wi...   \n",
              "\n",
              "                                              schema  \\\n",
              "0  Node properties:\\n- **Country**\\n  - `location...   \n",
              "1  Node properties:\\n- **Person**\\n  - `name`: ST...   \n",
              "2  Node properties:\\n- **Stream**\\n  - `createdAt...   \n",
              "3  Graph schema: Relevant node labels and their p...   \n",
              "4  Graph schema: Relevant node labels and their p...   \n",
              "\n",
              "                                              cypher  \\\n",
              "0  MATCH (f:Filing)-[:BENEFITS]->(e:Entity)-[:COU...   \n",
              "1  MATCH (o:Organization)-[:HAS_CEO]->(ceo:Person...   \n",
              "2  MATCH (s:Stream)-[:PLAYS]->(g:Game) WHERE s.to...   \n",
              "3  MATCH (n:Article) -[:HAS_KEY]->(m:Keyword) WIT...   \n",
              "4  MATCH (n:Author) WHERE n.first_name STARTS WIT...   \n",
              "\n",
              "                     data_source        instance_id  \\\n",
              "0      neo4jLabs_synthetic_gpt4o  instance_id_41185   \n",
              "1  neo4jLabs_synthetic_gpt4turbo  instance_id_26598   \n",
              "2     neo4jLabs_synthetic_gemini  instance_id_34035   \n",
              "3    neo4jLabs_functional_cypher   instance_id_3914   \n",
              "4    neo4jLabs_functional_cypher  instance_id_14645   \n",
              "\n",
              "      database_reference_alias  \n",
              "0     neo4jlabs_demo_db_fincen  \n",
              "1  neo4jlabs_demo_db_companies  \n",
              "2     neo4jlabs_demo_db_twitch  \n",
              "3                         None  \n",
              "4                         None  "
            ],
            "text/html": [
              "\n",
              "  <div id=\"df-00551c08-1c01-4071-856d-c9fb533a873e\" class=\"colab-df-container\">\n",
              "    <div>\n",
              "<style scoped>\n",
              "    .dataframe tbody tr th:only-of-type {\n",
              "        vertical-align: middle;\n",
              "    }\n",
              "\n",
              "    .dataframe tbody tr th {\n",
              "        vertical-align: top;\n",
              "    }\n",
              "\n",
              "    .dataframe thead th {\n",
              "        text-align: right;\n",
              "    }\n",
              "</style>\n",
              "<table border=\"1\" class=\"dataframe\">\n",
              "  <thead>\n",
              "    <tr style=\"text-align: right;\">\n",
              "      <th></th>\n",
              "      <th>question</th>\n",
              "      <th>schema</th>\n",
              "      <th>cypher</th>\n",
              "      <th>data_source</th>\n",
              "      <th>instance_id</th>\n",
              "      <th>database_reference_alias</th>\n",
              "    </tr>\n",
              "  </thead>\n",
              "  <tbody>\n",
              "    <tr>\n",
              "      <th>0</th>\n",
              "      <td>Which 3 countries have the most entities linke...</td>\n",
              "      <td>Node properties:\\n- **Country**\\n  - `location...</td>\n",
              "      <td>MATCH (f:Filing)-[:BENEFITS]-&gt;(e:Entity)-[:COU...</td>\n",
              "      <td>neo4jLabs_synthetic_gpt4o</td>\n",
              "      <td>instance_id_41185</td>\n",
              "      <td>neo4jlabs_demo_db_fincen</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>1</th>\n",
              "      <td>What are the names of the first 3 organization...</td>\n",
              "      <td>Node properties:\\n- **Person**\\n  - `name`: ST...</td>\n",
              "      <td>MATCH (o:Organization)-[:HAS_CEO]-&gt;(ceo:Person...</td>\n",
              "      <td>neo4jLabs_synthetic_gpt4turbo</td>\n",
              "      <td>instance_id_26598</td>\n",
              "      <td>neo4jlabs_demo_db_companies</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>2</th>\n",
              "      <td>List the names of the games played by streams ...</td>\n",
              "      <td>Node properties:\\n- **Stream**\\n  - `createdAt...</td>\n",
              "      <td>MATCH (s:Stream)-[:PLAYS]-&gt;(g:Game) WHERE s.to...</td>\n",
              "      <td>neo4jLabs_synthetic_gemini</td>\n",
              "      <td>instance_id_34035</td>\n",
              "      <td>neo4jlabs_demo_db_twitch</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>3</th>\n",
              "      <td>For each Article find its abstract and the cou...</td>\n",
              "      <td>Graph schema: Relevant node labels and their p...</td>\n",
              "      <td>MATCH (n:Article) -[:HAS_KEY]-&gt;(m:Keyword) WIT...</td>\n",
              "      <td>neo4jLabs_functional_cypher</td>\n",
              "      <td>instance_id_3914</td>\n",
              "      <td>None</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>4</th>\n",
              "      <td>Find the Author for which first_name starts wi...</td>\n",
              "      <td>Graph schema: Relevant node labels and their p...</td>\n",
              "      <td>MATCH (n:Author) WHERE n.first_name STARTS WIT...</td>\n",
              "      <td>neo4jLabs_functional_cypher</td>\n",
              "      <td>instance_id_14645</td>\n",
              "      <td>None</td>\n",
              "    </tr>\n",
              "  </tbody>\n",
              "</table>\n",
              "</div>\n",
              "    <div class=\"colab-df-buttons\">\n",
              "\n",
              "  <div class=\"colab-df-container\">\n",
              "    <button class=\"colab-df-convert\" onclick=\"convertToInteractive('df-00551c08-1c01-4071-856d-c9fb533a873e')\"\n",
              "            title=\"Convert this dataframe to an interactive table.\"\n",
              "            style=\"display:none;\">\n",
              "\n",
              "  <svg xmlns=\"http://www.w3.org/2000/svg\" height=\"24px\" viewBox=\"0 -960 960 960\">\n",
              "    <path d=\"M120-120v-720h720v720H120Zm60-500h600v-160H180v160Zm220 220h160v-160H400v160Zm0 220h160v-160H400v160ZM180-400h160v-160H180v160Zm440 0h160v-160H620v160ZM180-180h160v-160H180v160Zm440 0h160v-160H620v160Z\"/>\n",
              "  </svg>\n",
              "    </button>\n",
              "\n",
              "  <style>\n",
              "    .colab-df-container {\n",
              "      display:flex;\n",
              "      gap: 12px;\n",
              "    }\n",
              "\n",
              "    .colab-df-convert {\n",
              "      background-color: #E8F0FE;\n",
              "      border: none;\n",
              "      border-radius: 50%;\n",
              "      cursor: pointer;\n",
              "      display: none;\n",
              "      fill: #1967D2;\n",
              "      height: 32px;\n",
              "      padding: 0 0 0 0;\n",
              "      width: 32px;\n",
              "    }\n",
              "\n",
              "    .colab-df-convert:hover {\n",
              "      background-color: #E2EBFA;\n",
              "      box-shadow: 0px 1px 2px rgba(60, 64, 67, 0.3), 0px 1px 3px 1px rgba(60, 64, 67, 0.15);\n",
              "      fill: #174EA6;\n",
              "    }\n",
              "\n",
              "    .colab-df-buttons div {\n",
              "      margin-bottom: 4px;\n",
              "    }\n",
              "\n",
              "    [theme=dark] .colab-df-convert {\n",
              "      background-color: #3B4455;\n",
              "      fill: #D2E3FC;\n",
              "    }\n",
              "\n",
              "    [theme=dark] .colab-df-convert:hover {\n",
              "      background-color: #434B5C;\n",
              "      box-shadow: 0px 1px 3px 1px rgba(0, 0, 0, 0.15);\n",
              "      filter: drop-shadow(0px 1px 2px rgba(0, 0, 0, 0.3));\n",
              "      fill: #FFFFFF;\n",
              "    }\n",
              "  </style>\n",
              "\n",
              "    <script>\n",
              "      const buttonEl =\n",
              "        document.querySelector('#df-00551c08-1c01-4071-856d-c9fb533a873e button.colab-df-convert');\n",
              "      buttonEl.style.display =\n",
              "        google.colab.kernel.accessAllowed ? 'block' : 'none';\n",
              "\n",
              "      async function convertToInteractive(key) {\n",
              "        const element = document.querySelector('#df-00551c08-1c01-4071-856d-c9fb533a873e');\n",
              "        const dataTable =\n",
              "          await google.colab.kernel.invokeFunction('convertToInteractive',\n",
              "                                                    [key], {});\n",
              "        if (!dataTable) return;\n",
              "\n",
              "        const docLinkHtml = 'Like what you see? Visit the ' +\n",
              "          '<a target=\"_blank\" href=https://colab.research.google.com/notebooks/data_table.ipynb>data table notebook</a>'\n",
              "          + ' to learn more about interactive tables.';\n",
              "        element.innerHTML = '';\n",
              "        dataTable['output_type'] = 'display_data';\n",
              "        await google.colab.output.renderOutput(dataTable, element);\n",
              "        const docLink = document.createElement('div');\n",
              "        docLink.innerHTML = docLinkHtml;\n",
              "        element.appendChild(docLink);\n",
              "      }\n",
              "    </script>\n",
              "  </div>\n",
              "\n",
              "\n",
              "<div id=\"df-c07f26d0-aa5e-4dc7-bbc6-bf22d077229c\">\n",
              "  <button class=\"colab-df-quickchart\" onclick=\"quickchart('df-c07f26d0-aa5e-4dc7-bbc6-bf22d077229c')\"\n",
              "            title=\"Suggest charts\"\n",
              "            style=\"display:none;\">\n",
              "\n",
              "<svg xmlns=\"http://www.w3.org/2000/svg\" height=\"24px\"viewBox=\"0 0 24 24\"\n",
              "     width=\"24px\">\n",
              "    <g>\n",
              "        <path d=\"M19 3H5c-1.1 0-2 .9-2 2v14c0 1.1.9 2 2 2h14c1.1 0 2-.9 2-2V5c0-1.1-.9-2-2-2zM9 17H7v-7h2v7zm4 0h-2V7h2v10zm4 0h-2v-4h2v4z\"/>\n",
              "    </g>\n",
              "</svg>\n",
              "  </button>\n",
              "\n",
              "<style>\n",
              "  .colab-df-quickchart {\n",
              "      --bg-color: #E8F0FE;\n",
              "      --fill-color: #1967D2;\n",
              "      --hover-bg-color: #E2EBFA;\n",
              "      --hover-fill-color: #174EA6;\n",
              "      --disabled-fill-color: #AAA;\n",
              "      --disabled-bg-color: #DDD;\n",
              "  }\n",
              "\n",
              "  [theme=dark] .colab-df-quickchart {\n",
              "      --bg-color: #3B4455;\n",
              "      --fill-color: #D2E3FC;\n",
              "      --hover-bg-color: #434B5C;\n",
              "      --hover-fill-color: #FFFFFF;\n",
              "      --disabled-bg-color: #3B4455;\n",
              "      --disabled-fill-color: #666;\n",
              "  }\n",
              "\n",
              "  .colab-df-quickchart {\n",
              "    background-color: var(--bg-color);\n",
              "    border: none;\n",
              "    border-radius: 50%;\n",
              "    cursor: pointer;\n",
              "    display: none;\n",
              "    fill: var(--fill-color);\n",
              "    height: 32px;\n",
              "    padding: 0;\n",
              "    width: 32px;\n",
              "  }\n",
              "\n",
              "  .colab-df-quickchart:hover {\n",
              "    background-color: var(--hover-bg-color);\n",
              "    box-shadow: 0 1px 2px rgba(60, 64, 67, 0.3), 0 1px 3px 1px rgba(60, 64, 67, 0.15);\n",
              "    fill: var(--button-hover-fill-color);\n",
              "  }\n",
              "\n",
              "  .colab-df-quickchart-complete:disabled,\n",
              "  .colab-df-quickchart-complete:disabled:hover {\n",
              "    background-color: var(--disabled-bg-color);\n",
              "    fill: var(--disabled-fill-color);\n",
              "    box-shadow: none;\n",
              "  }\n",
              "\n",
              "  .colab-df-spinner {\n",
              "    border: 2px solid var(--fill-color);\n",
              "    border-color: transparent;\n",
              "    border-bottom-color: var(--fill-color);\n",
              "    animation:\n",
              "      spin 1s steps(1) infinite;\n",
              "  }\n",
              "\n",
              "  @keyframes spin {\n",
              "    0% {\n",
              "      border-color: transparent;\n",
              "      border-bottom-color: var(--fill-color);\n",
              "      border-left-color: var(--fill-color);\n",
              "    }\n",
              "    20% {\n",
              "      border-color: transparent;\n",
              "      border-left-color: var(--fill-color);\n",
              "      border-top-color: var(--fill-color);\n",
              "    }\n",
              "    30% {\n",
              "      border-color: transparent;\n",
              "      border-left-color: var(--fill-color);\n",
              "      border-top-color: var(--fill-color);\n",
              "      border-right-color: var(--fill-color);\n",
              "    }\n",
              "    40% {\n",
              "      border-color: transparent;\n",
              "      border-right-color: var(--fill-color);\n",
              "      border-top-color: var(--fill-color);\n",
              "    }\n",
              "    60% {\n",
              "      border-color: transparent;\n",
              "      border-right-color: var(--fill-color);\n",
              "    }\n",
              "    80% {\n",
              "      border-color: transparent;\n",
              "      border-right-color: var(--fill-color);\n",
              "      border-bottom-color: var(--fill-color);\n",
              "    }\n",
              "    90% {\n",
              "      border-color: transparent;\n",
              "      border-bottom-color: var(--fill-color);\n",
              "    }\n",
              "  }\n",
              "</style>\n",
              "\n",
              "  <script>\n",
              "    async function quickchart(key) {\n",
              "      const quickchartButtonEl =\n",
              "        document.querySelector('#' + key + ' button');\n",
              "      quickchartButtonEl.disabled = true;  // To prevent multiple clicks.\n",
              "      quickchartButtonEl.classList.add('colab-df-spinner');\n",
              "      try {\n",
              "        const charts = await google.colab.kernel.invokeFunction(\n",
              "            'suggestCharts', [key], {});\n",
              "      } catch (error) {\n",
              "        console.error('Error during call to suggestCharts:', error);\n",
              "      }\n",
              "      quickchartButtonEl.classList.remove('colab-df-spinner');\n",
              "      quickchartButtonEl.classList.add('colab-df-quickchart-complete');\n",
              "    }\n",
              "    (() => {\n",
              "      let quickchartButtonEl =\n",
              "        document.querySelector('#df-c07f26d0-aa5e-4dc7-bbc6-bf22d077229c button');\n",
              "      quickchartButtonEl.style.display =\n",
              "        google.colab.kernel.accessAllowed ? 'block' : 'none';\n",
              "    })();\n",
              "  </script>\n",
              "</div>\n",
              "\n",
              "    </div>\n",
              "  </div>\n"
            ],
            "application/vnd.google.colaboratory.intrinsic+json": {
              "type": "dataframe",
              "variable_name": "df",
              "summary": "{\n  \"name\": \"df\",\n  \"rows\": 39554,\n  \"fields\": [\n    {\n      \"column\": \"question\",\n      \"properties\": {\n        \"dtype\": \"string\",\n        \"num_unique_values\": 32024,\n        \"samples\": [\n          \"What are the names of the top 3 organizations with the highest revenue?\",\n          \"Show the first 3 questions asked by 'Christopher'.\",\n          \"What are the properties of nodes connected to DOI for which name is 10.1016/S0040-9383(00)00015-X, and what are their relationships to DOI?\"\n        ],\n        \"semantic_type\": \"\",\n        \"description\": \"\"\n      }\n    },\n    {\n      \"column\": \"schema\",\n      \"properties\": {\n        \"dtype\": \"category\",\n        \"num_unique_values\": 966,\n        \"samples\": [\n          \"Graph schema: Relevant node labels and their properties (with datatypes) are:\\nCategories {specifications: STRING}\\nCategories {specifications: STRING}\",\n          \"Graph schema: Relevant node labels and their properties (with datatypes) are:\\nArticle {title: STRING}\\nUpdateDate {update_date: DATE}\",\n          \"Graph schema: Relevant node labels and their properties (with datatypes) are:\\nTopic {description: STRING}\\nReport {report_no: STRING}\"\n        ],\n        \"semantic_type\": \"\",\n        \"description\": \"\"\n      }\n    },\n    {\n      \"column\": \"cypher\",\n      \"properties\": {\n        \"dtype\": \"string\",\n        \"num_unique_values\": 37306,\n        \"samples\": [\n          \"MATCH (q:Question) WITH q ORDER BY q.view_count ASC LIMIT 1 RETURN q.creation_date\",\n          \"MATCH (e:Entity {internal_id: '1001263'}) RETURN e.incorporation_date\",\n          \"MATCH (n:Author) WHERE n.first_name <> 'A.' RETURN DISTINCT n.first_name AS first_name\"\n        ],\n        \"semantic_type\": \"\",\n        \"description\": \"\"\n      }\n    },\n    {\n      \"column\": \"data_source\",\n      \"properties\": {\n        \"dtype\": \"category\",\n        \"num_unique_values\": 20,\n        \"samples\": [\n          \"neo4jLabs_synthetic_gpt4o\",\n          \"cyspider_t5base_prefix_incorrect\",\n          \"cyspider_uncased_train\"\n        ],\n        \"semantic_type\": \"\",\n        \"description\": \"\"\n      }\n    },\n    {\n      \"column\": \"instance_id\",\n      \"properties\": {\n        \"dtype\": \"string\",\n        \"num_unique_values\": 39554,\n        \"samples\": [\n          \"instance_id_11113\",\n          \"instance_id_38203\",\n          \"instance_id_26184\"\n        ],\n        \"semantic_type\": \"\",\n        \"description\": \"\"\n      }\n    },\n    {\n      \"column\": \"database_reference_alias\",\n      \"properties\": {\n        \"dtype\": \"category\",\n        \"num_unique_values\": 17,\n        \"samples\": [\n          \"neo4jlabs_demo_db_fincen\",\n          \"neo4jlabs_demo_db_companies\",\n          \"neo4jlabs_demo_db_recommendations\"\n        ],\n        \"semantic_type\": \"\",\n        \"description\": \"\"\n      }\n    }\n  ]\n}"
            }
          },
          "metadata": {},
          "execution_count": 38
        }
      ]
    },
    {
      "cell_type": "code",
      "source": [
        "\n",
        "model_name = \"deepseek-ai/DeepSeek-R1-Distill-Qwen-7B\"\n",
        "# bnb_config = BitsAndBytesConfig(\n",
        "#     load_in_4bit=True,\n",
        "#     bnb_4bit_use_double_quant=True,\n",
        "#     bnb_4bit_quant_type=\"nf4\",\n",
        "#     bnb_4bit_compute_dtype=torch.bfloat16,\n",
        "# )\n",
        "tokenizer = AutoTokenizer.from_pretrained(model_name)\n",
        "model = AutoModelForCausalLM.from_pretrained(\n",
        "    model_name,\n",
        "    # quantization_config=bnb_config,\n",
        "    torch_dtype=torch.bfloat16,\n",
        ").to(device='cuda')\n",
        "print(model.device)"
      ],
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/",
          "height": 405,
          "referenced_widgets": [
            "9caf5db719494b90b148b27a10fe86f7",
            "675e5fb93a4b474ba96c78c1216b6b5c",
            "2aac871de0fd46d49d4fb6efdc7c1ef0",
            "49f600813a9f4174bb4d0ee49e8a353d",
            "ca90459492d34489a4cb2bc263738f6d",
            "bb7ce9c9dca44d6d92ee9ea3c23b5196",
            "bc9e4eac82b4453e800ee2d9ff210445",
            "66466156c8714d1cb18b29ff936550aa",
            "9fbc983f3e4e4fe48d510d6f7189d215",
            "2557eb04cc9745a7b2a5b2a3897e6dcc",
            "361844a359784a2ea63c71570fac53b9"
          ]
        },
        "id": "yELPvUZOV3rI",
        "outputId": "34d0f98c-7779-453d-d936-2acfca191650"
      },
      "execution_count": null,
      "outputs": [
        {
          "output_type": "display_data",
          "data": {
            "text/plain": [
              "Loading checkpoint shards:   0%|          | 0/2 [00:00<?, ?it/s]"
            ],
            "application/vnd.jupyter.widget-view+json": {
              "version_major": 2,
              "version_minor": 0,
              "model_id": "9caf5db719494b90b148b27a10fe86f7"
            }
          },
          "metadata": {}
        },
        {
          "output_type": "error",
          "ename": "OutOfMemoryError",
          "evalue": "CUDA out of memory. Tried to allocate 130.00 MiB. GPU 0 has a total capacity of 22.16 GiB of which 45.38 MiB is free. Process 3373 has 22.11 GiB memory in use. Of the allocated memory 21.74 GiB is allocated by PyTorch, and 147.75 MiB is reserved by PyTorch but unallocated. If reserved but unallocated memory is large try setting PYTORCH_CUDA_ALLOC_CONF=expandable_segments:True to avoid fragmentation.  See documentation for Memory Management  (https://pytorch.org/docs/stable/notes/cuda.html#environment-variables)",
          "traceback": [
            "\u001b[0;31m---------------------------------------------------------------------------\u001b[0m",
            "\u001b[0;31mOutOfMemoryError\u001b[0m                          Traceback (most recent call last)",
            "\u001b[0;32m<ipython-input-19-17ac3ddc7f1e>\u001b[0m in \u001b[0;36m<cell line: 0>\u001b[0;34m()\u001b[0m\n\u001b[1;32m     11\u001b[0m     \u001b[0;31m# quantization_config=bnb_config,\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m     12\u001b[0m     \u001b[0mtorch_dtype\u001b[0m\u001b[0;34m=\u001b[0m\u001b[0mtorch\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mbfloat16\u001b[0m\u001b[0;34m,\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m---> 13\u001b[0;31m ).to(device='cuda')\n\u001b[0m\u001b[1;32m     14\u001b[0m \u001b[0mprint\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mmodel\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mdevice\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
            "\u001b[0;32m/usr/local/lib/python3.11/dist-packages/transformers/modeling_utils.py\u001b[0m in \u001b[0;36mto\u001b[0;34m(self, *args, **kwargs)\u001b[0m\n\u001b[1;32m   3108\u001b[0m                     \u001b[0;34m\" `dtype` by passing the correct `torch_dtype` argument.\"\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m   3109\u001b[0m                 )\n\u001b[0;32m-> 3110\u001b[0;31m         \u001b[0;32mreturn\u001b[0m \u001b[0msuper\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mto\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m*\u001b[0m\u001b[0margs\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0;34m**\u001b[0m\u001b[0mkwargs\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m   3111\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m   3112\u001b[0m     \u001b[0;32mdef\u001b[0m \u001b[0mhalf\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mself\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0;34m*\u001b[0m\u001b[0margs\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
            "\u001b[0;32m/usr/local/lib/python3.11/dist-packages/torch/nn/modules/module.py\u001b[0m in \u001b[0;36mto\u001b[0;34m(self, *args, **kwargs)\u001b[0m\n\u001b[1;32m   1338\u001b[0m                     \u001b[0;32mraise\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m   1339\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m-> 1340\u001b[0;31m         \u001b[0;32mreturn\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0m_apply\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mconvert\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m   1341\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m   1342\u001b[0m     def register_full_backward_pre_hook(\n",
            "\u001b[0;32m/usr/local/lib/python3.11/dist-packages/torch/nn/modules/module.py\u001b[0m in \u001b[0;36m_apply\u001b[0;34m(self, fn, recurse)\u001b[0m\n\u001b[1;32m    898\u001b[0m         \u001b[0;32mif\u001b[0m \u001b[0mrecurse\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    899\u001b[0m             \u001b[0;32mfor\u001b[0m \u001b[0mmodule\u001b[0m \u001b[0;32min\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mchildren\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--> 900\u001b[0;31m                 \u001b[0mmodule\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0m_apply\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mfn\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    901\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    902\u001b[0m         \u001b[0;32mdef\u001b[0m \u001b[0mcompute_should_use_set_data\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mtensor\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mtensor_applied\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
            "\u001b[0;32m/usr/local/lib/python3.11/dist-packages/torch/nn/modules/module.py\u001b[0m in \u001b[0;36m_apply\u001b[0;34m(self, fn, recurse)\u001b[0m\n\u001b[1;32m    898\u001b[0m         \u001b[0;32mif\u001b[0m \u001b[0mrecurse\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    899\u001b[0m             \u001b[0;32mfor\u001b[0m \u001b[0mmodule\u001b[0m \u001b[0;32min\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mchildren\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--> 900\u001b[0;31m                 \u001b[0mmodule\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0m_apply\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mfn\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    901\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    902\u001b[0m         \u001b[0;32mdef\u001b[0m \u001b[0mcompute_should_use_set_data\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mtensor\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mtensor_applied\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
            "\u001b[0;32m/usr/local/lib/python3.11/dist-packages/torch/nn/modules/module.py\u001b[0m in \u001b[0;36m_apply\u001b[0;34m(self, fn, recurse)\u001b[0m\n\u001b[1;32m    898\u001b[0m         \u001b[0;32mif\u001b[0m \u001b[0mrecurse\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    899\u001b[0m             \u001b[0;32mfor\u001b[0m \u001b[0mmodule\u001b[0m \u001b[0;32min\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mchildren\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--> 900\u001b[0;31m                 \u001b[0mmodule\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0m_apply\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mfn\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    901\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    902\u001b[0m         \u001b[0;32mdef\u001b[0m \u001b[0mcompute_should_use_set_data\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mtensor\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mtensor_applied\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
            "\u001b[0;32m/usr/local/lib/python3.11/dist-packages/torch/nn/modules/module.py\u001b[0m in \u001b[0;36m_apply\u001b[0;34m(self, fn, recurse)\u001b[0m\n\u001b[1;32m    898\u001b[0m         \u001b[0;32mif\u001b[0m \u001b[0mrecurse\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    899\u001b[0m             \u001b[0;32mfor\u001b[0m \u001b[0mmodule\u001b[0m \u001b[0;32min\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mchildren\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--> 900\u001b[0;31m                 \u001b[0mmodule\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0m_apply\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mfn\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    901\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    902\u001b[0m         \u001b[0;32mdef\u001b[0m \u001b[0mcompute_should_use_set_data\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mtensor\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mtensor_applied\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
            "\u001b[0;32m/usr/local/lib/python3.11/dist-packages/torch/nn/modules/module.py\u001b[0m in \u001b[0;36m_apply\u001b[0;34m(self, fn, recurse)\u001b[0m\n\u001b[1;32m    898\u001b[0m         \u001b[0;32mif\u001b[0m \u001b[0mrecurse\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    899\u001b[0m             \u001b[0;32mfor\u001b[0m \u001b[0mmodule\u001b[0m \u001b[0;32min\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mchildren\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--> 900\u001b[0;31m                 \u001b[0mmodule\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0m_apply\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mfn\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    901\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    902\u001b[0m         \u001b[0;32mdef\u001b[0m \u001b[0mcompute_should_use_set_data\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mtensor\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mtensor_applied\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
            "\u001b[0;32m/usr/local/lib/python3.11/dist-packages/torch/nn/modules/module.py\u001b[0m in \u001b[0;36m_apply\u001b[0;34m(self, fn, recurse)\u001b[0m\n\u001b[1;32m    925\u001b[0m             \u001b[0;31m# `with torch.no_grad():`\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    926\u001b[0m             \u001b[0;32mwith\u001b[0m \u001b[0mtorch\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mno_grad\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--> 927\u001b[0;31m                 \u001b[0mparam_applied\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mfn\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mparam\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    928\u001b[0m             \u001b[0mp_should_use_set_data\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mcompute_should_use_set_data\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mparam\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mparam_applied\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    929\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n",
            "\u001b[0;32m/usr/local/lib/python3.11/dist-packages/torch/nn/modules/module.py\u001b[0m in \u001b[0;36mconvert\u001b[0;34m(t)\u001b[0m\n\u001b[1;32m   1324\u001b[0m                         \u001b[0mmemory_format\u001b[0m\u001b[0;34m=\u001b[0m\u001b[0mconvert_to_format\u001b[0m\u001b[0;34m,\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m   1325\u001b[0m                     )\n\u001b[0;32m-> 1326\u001b[0;31m                 return t.to(\n\u001b[0m\u001b[1;32m   1327\u001b[0m                     \u001b[0mdevice\u001b[0m\u001b[0;34m,\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m   1328\u001b[0m                     \u001b[0mdtype\u001b[0m \u001b[0;32mif\u001b[0m \u001b[0mt\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mis_floating_point\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m \u001b[0;32mor\u001b[0m \u001b[0mt\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mis_complex\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m \u001b[0;32melse\u001b[0m \u001b[0;32mNone\u001b[0m\u001b[0;34m,\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
            "\u001b[0;31mOutOfMemoryError\u001b[0m: CUDA out of memory. Tried to allocate 130.00 MiB. GPU 0 has a total capacity of 22.16 GiB of which 45.38 MiB is free. Process 3373 has 22.11 GiB memory in use. Of the allocated memory 21.74 GiB is allocated by PyTorch, and 147.75 MiB is reserved by PyTorch but unallocated. If reserved but unallocated memory is large try setting PYTORCH_CUDA_ALLOC_CONF=expandable_segments:True to avoid fragmentation.  See documentation for Memory Management  (https://pytorch.org/docs/stable/notes/cuda.html#environment-variables)"
          ]
        }
      ]
    },
    {
      "cell_type": "code",
      "source": [
        "cc = 1\n",
        "df_toy = df.head(10)\n",
        "print(df_toy)\n",
        "responses = []\n",
        "# for i in range(cc):\n",
        "tokenizer.pad_token = tokenizer.eos_token\n",
        "question = df_toy.iloc[0]['question']\n",
        "schema = df_toy.iloc[0]['schema']\n",
        "print(question)\n",
        "print(schema)\n",
        "new_message = prepare_chat_prompt(question=question, schema=schema)\n",
        "prompt = f\"<|im_start|>{new_message}.<|im_end|>\\n<|im_start|>assistant\\n\"\n",
        "\n",
        "inputs = tokenizer(prompt, return_tensors=\"pt\").to(model.device)\n",
        "outputs = model.generate(\n",
        "    **inputs,\n",
        "    max_new_tokens=1000,\n",
        "    temperature=0.2,\n",
        "    top_p=0.9,\n",
        "    pad_token_id=tokenizer.eos_token_id\n",
        ")\n",
        "response = tokenizer.decode(outputs[0], skip_special_tokens=False)\n",
        "responses.append(response)\n",
        "print(i)\n",
        "print(responses)"
      ],
      "metadata": {
        "id": "5KnS8Z_NJm0h"
      },
      "execution_count": null,
      "outputs": []
    },
    {
      "cell_type": "code",
      "source": [
        "df_toy.iloc[0]['cypher']\n",
        "df_toy.iloc[0]['question']"
      ],
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/",
          "height": 35
        },
        "id": "WKqFinm0OiES",
        "outputId": "71f930d5-2815-4831-fd06-4941ed4800d9"
      },
      "execution_count": null,
      "outputs": [
        {
          "output_type": "execute_result",
          "data": {
            "text/plain": [
              "'Which 3 countries have the most entities linked as beneficiaries in filings?'"
            ],
            "application/vnd.google.colaboratory.intrinsic+json": {
              "type": "string"
            }
          },
          "metadata": {},
          "execution_count": 48
        }
      ]
    },
    {
      "cell_type": "code",
      "source": [
        "<｜begin▁of▁sentence｜><|im_start|>[{'role': 'user', 'content': 'Generate Cypher statement to query a graph database. Use only the provided relationship types and properties in the schema. \\nSchema: Node properties:\\n- **Country**\\n  - `location`: POINT \\n  - `code`: STRING Example: \"AFG\"\\n  - `name`: STRING Example: \"Afghanistan\"\\n  - `tld`: STRING Example: \"AF\"\\n- **Filing**\\n  - `begin`: DATE_TIME Min: 2000-02-08T00:00:00Z, Max: 2017-09-05T00:00:00Z\\n  - `end`: DATE_TIME Min: 2000-02-08T00:00:00Z, Max: 2017-11-03T00:00:00Z\\n  - `originator_bank_id`: STRING Example: \"cimb-bank-berhad\"\\n  - `sar_id`: STRING Example: \"3297\"\\n  - `beneficiary_bank`: STRING Example: \"Barclays Bank Plc\"\\n  - `filer_org_name_id`: STRING Example: \"the-bank-of-new-york-mellon-corp\"\\n  - `originator_bank_country`: STRING Example: \"Singapore\"\\n  - `beneficiary_bank_country`: STRING Example: \"United Kingdom\"\\n  - `filer_org_name`: STRING Example: \"The Bank of New York Mellon Corp.\"\\n  - `originator_iso`: STRING Example: \"SGP\"\\n  - `beneficiary_bank_id`: STRING Example: \"barclays-bank-plc-london-england-gbr\"\\n  - `origin_lat`: STRING Example: \"1.3667\"\\n  - `origin_lng`: STRING Example: \"103.8\"\\n  - `end_date_format`: STRING Example: \"2015-09-25T00:00:00Z\"\\n  - `begin_date_format`: STRING Example: \"2015-03-25T00:00:00Z\"\\n  - `originator_bank`: STRING Example: \"CIMB Bank Berhad\"\\n  - `beneficiary_lat`: STRING Example: \"54\"\\n  - `beneficiary_iso`: STRING Example: \"GBR\"\\n  - `beneficiary_lng`: STRING Example: \"-2\"\\n  - `begin_date`: STRING Example: \"Mar 25, 2015\"\\n  - `id`: STRING Example: \"223254\"\\n  - `end_date`: STRING Example: \"Sep 25, 2015\"\\n  - `amount`: INTEGER Min: 1.18, Max: 2721000000\\n  - `number`: INTEGER Min: 1, Max: 174\\n- **Entity**\\n  - `id`: STRING Example: \"the-bank-of-new-york-mellon-corp\"\\n  - `location`: POINT \\n  - `name`: STRING Example: \"The Bank of New York Mellon Corp.\"\\n  - `country`: STRING Example: \"CHN\"\\nRelationship properties:\\n\\nThe relationships:\\n(:Filing)-[:BENEFITS]->(:Entity)\\n(:Filing)-[:CONCERNS]->(:Entity)\\n(:Filing)-[:ORIGINATOR]->(:Entity)\\n(:Entity)-[:FILED]->(:Filing)\\n(:Entity)-[:COUNTRY]->(:Country) \\n Question: Which 3 countries have the most entities linked as beneficiaries in filings?  \\n Cypher output: '}].<|im_end|>\n",
        "<|im_start|>assistant\n",
        "Alright, so I need to figure out which three countries have the most entities linked as beneficiaries in filings using the provided schema and relationships. Let me break this down step by step.\n",
        "\n",
        "First, I'll look at the schema provided. There are two main node types: **Country** and **Filing**. The **Filing** node has several properties, including `originator_bank_country` and `beneficiary_bank_country`, both of which are strings representing countries. Additionally, there's a relationship property `:COUNTRY` that links **Entity** nodes to **Country** nodes. However, the question is about entities linked as beneficiaries, so I might not need the `:COUNTRY` relationship directly unless I'm considering the country context of the entities.\n",
        "\n",
        "The relationships given are:\n",
        "- (:Filing)-[:BENEFITS]->(:Entity)\n",
        "- (:Filing)-[:CONCERNS]->(:Entity)\n",
        "- (:Filing)-[:ORIGINATOR]->(:Entity)\n",
        "- (:Entity)-[:FILED]->(:Filing)\n",
        "- (:Entity)-[:COUNTRY]->(:Country)\n",
        "\n",
        "But since the question is about entities linked as beneficiaries, I should focus on the `:BENEFITS` relationship. Each `:Filing` node can have multiple `:Entity` nodes connected via `:BENEFITS`, meaning each entity is a beneficiary in a filing.\n",
        "\n",
        "To find the countries with the most entities as beneficiaries, I need to:\n",
        "1. Identify all `:Entity` nodes connected via `:BENEFITS` to `:Filing` nodes.\n",
        "2. For each of these entities, find their `beneficiary_bank_country` property, which should be the country of the bank acting as the beneficiary.\n",
        "3. Count how many entities have their `beneficiary_bank_country` as each country.\n",
        "4. Sort these countries by the count of entities and select the top three.\n",
        "\n",
        "I should also consider if there are any constraints or properties that might affect this count. For example, if an entity appears multiple times in different filings, each occurrence should be counted separately. However, the schema doesn't specify if an entity can be linked multiple times to the same country, so I'll assume each connection is a separate count.\n",
        "\n",
        "Now, translating this into a Cypher query. I need to:\n",
        "- Start with the `:Entity` nodes.\n",
        "- Filter those that have a `:BENEFITS` relationship to a `:Filing`.\n",
        "- Group these entities by their `beneficiary_bank_country`.\n",
        "- Count the number of entities per country.\n",
        "- Order the results by count in descending order.\n",
        "- Select the top three countries.\n",
        "\n",
        "Putting this into a Cypher statement, it would look something like this:\n",
        "\n",
        "```cypher\n",
        "MATCH (e:Entity {relationship: [:BENEFITS]})\n",
        " OPTIONAL MATCH (f:Filing)-[:BENEFITS]->(e)\n",
        " RETURN e.beneficiary_bank_country, COUNT(e) AS count\n",
        "ORDER BY DESC(count)\n",
        "LIMIT 3\n",
        "```\n",
        "\n",
        "Wait, that might not be exactly right. Let me refine it. I need to ensure that I'm only considering entities that have at least one `:BENEFITS` relationship. Also, the `relationship` property in the `:BENEFITS` relationship is optional, so I should adjust the match pattern accordingly.\n",
        "\n",
        "Perhaps a better approach is:\n",
        "\n",
        "```cypher\n",
        "MATCH (:Filing)-[:BENEFITS]->(:Entity)\n",
        " OPTIONAL MATCH (:Filing)-[:BENEFITS]->(:Entity)\n",
        " OPTIONAL MATCH (:Filing)-[:BENEFITS]->(:Entity)\n",
        "  ... but this seems repetitive. Instead, I can use a subquery to get all entities connected via `:BENEFITS` to `:Filing`.\n",
        "\n",
        "Wait, maybe a better way is to use a projection that includes all entities that are connected via `:BENEFITS` to `:Filing`. Then, group by `beneficiary_bank_country` and count.\n",
        "\n",
        "So, the correct Cypher statement would be:\n",
        "\n",
        "```cypher\n",
        "MATCH (:Filing)-[:BENEFITS]->(:Entity) AS e\n",
        "GROUP BY e.beneficiary_bank_country\n",
        "ORDER BY COUNT(e) DESC\n",
        "LIMIT 3\n",
        "```\n",
        "# MATCH (f:Filing)-[:BENEFITS]->(e:Entity)-[:COUNTRY]->(c:Country)\n",
        "# WITH c.name AS country, COUNT(e) AS entityCount\n",
        "# ORDER BY entityCount DESC\n",
        "# LIMIT 3\n",
        "# RETURN country, entityCount\n",
        "\n",
        "But I think I need to ensure that each entity is only counted once per country, even if they appear in multiple filings. However, the question asks for the number of entities linked as beneficiaries, so each unique entity per country is counted once, regardless of how many times they appear in different filings.\n",
        "\n",
        "Wait, no. If an entity is a beneficiary in multiple filings, it should still be counted once per country, but the count should reflect how many times the entity is linked to that country. But I think the question is asking for the number of unique entities per country, not the number of times they appear in filings.\n",
        "\n",
        "Wait"
      ],
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/",
          "height": 104
        },
        "id": "4WMDYmi3NyLE",
        "outputId": "2401ac18-52f1-4cf1-86e3-0b5f4aebc6d1"
      },
      "execution_count": null,
      "outputs": [
        {
          "output_type": "execute_result",
          "data": {
            "text/plain": [
              "'<｜begin▁of▁sentence｜><|im_start|>[{\\'role\\': \\'user\\', \\'content\\': \\'Generate Cypher statement to query a graph database. Use only the provided relationship types and properties in the schema. \\\\nSchema: Node properties:\\\\n- **Country**\\\\n  - `location`: POINT \\\\n  - `code`: STRING Example: \"AFG\"\\\\n  - `name`: STRING Example: \"Afghanistan\"\\\\n  - `tld`: STRING Example: \"AF\"\\\\n- **Filing**\\\\n  - `begin`: DATE_TIME Min: 2000-02-08T00:00:00Z, Max: 2017-09-05T00:00:00Z\\\\n  - `end`: DATE_TIME Min: 2000-02-08T00:00:00Z, Max: 2017-11-03T00:00:00Z\\\\n  - `originator_bank_id`: STRING Example: \"cimb-bank-berhad\"\\\\n  - `sar_id`: STRING Example: \"3297\"\\\\n  - `beneficiary_bank`: STRING Example: \"Barclays Bank Plc\"\\\\n  - `filer_org_name_id`: STRING Example: \"the-bank-of-new-york-mellon-corp\"\\\\n  - `originator_bank_country`: STRING Example: \"Singapore\"\\\\n  - `beneficiary_bank_country`: STRING Example: \"United Kingdom\"\\\\n  - `filer_org_name`: STRING Example: \"The Bank of New York Mellon Corp.\"\\\\n  - `originator_iso`: STRING Example: \"SGP\"\\\\n  - `beneficiary_bank_id`: STRING Example: \"barclays-bank-plc-london-england-gbr\"\\\\n  - `origin_lat`: STRING Example: \"1.3667\"\\\\n  - `origin_lng`: STRING Example: \"103.8\"\\\\n  - `end_date_format`: STRING Example: \"2015-09-25T00:00:00Z\"\\\\n  - `begin_date_format`: STRING Example: \"2015-03-25T00:00:00Z\"\\\\n  - `originator_bank`: STRING Example: \"CIMB Bank Berhad\"\\\\n  - `beneficiary_lat`: STRING Example: \"54\"\\\\n  - `beneficiary_iso`: STRING Example: \"GBR\"\\\\n  - `beneficiary_lng`: STRING Example: \"-2\"\\\\n  - `begin_date`: STRING Example: \"Mar 25, 2015\"\\\\n  - `id`: STRING Example: \"223254\"\\\\n  - `end_date`: STRING Example: \"Sep 25, 2015\"\\\\n  - `amount`: INTEGER Min: 1.18, Max: 2721000000\\\\n  - `number`: INTEGER Min: 1, Max: 174\\\\n- **Entity**\\\\n  - `id`: STRING Example: \"the-bank-of-new-york-mellon-corp\"\\\\n  - `location`: POINT \\\\n  - `name`: STRING Example: \"The Bank of New York Mellon Corp.\"\\\\n  - `country`: STRING Example: \"CHN\"\\\\nRelationship properties:\\\\n\\\\nThe relationships:\\\\n(:Filing)-[:BENEFITS]->(:Entity)\\\\n(:Filing)-[:CONCERNS]->(:Entity)\\\\n(:Filing)-[:ORIGINATOR]->(:Entity)\\\\n(:Entity)-[:FILED]->(:Filing)\\\\n(:Entity)-[:COUNTRY]->(:Country) \\\\n Question: Which 3 countries have the most entities linked as beneficiaries in filings?  \\\\n Cypher output: \\'}].<|im_end|>\\n<|im_start|>assistant\\nAlright, so I need to figure out which three countries have the most entities linked as beneficiaries in filings using the provided schema and relationships. Let me break this down step by step.\\n\\nFirst, I\\'ll look at the schema provided. There are two main node types: **Country** and **Filing**. The **Filing** node has several properties, including `originator_bank_country` and `beneficiary_bank_country`, both of which are strings representing countries. Additionally, there\\'s a relationship property `:COUNTRY` that links **Entity** nodes to **Country** nodes. However, the question is about entities linked as beneficiaries, so I might not need the `:COUNTRY` relationship directly unless I\\'m considering the country context of the entities.\\n\\nThe relationships given are:\\n- (:Filing)-[:BENEFITS]->(:Entity)\\n- (:Filing)-[:CONCERNS]->(:Entity)\\n- (:Filing)-[:ORIGINATOR]->(:Entity)\\n- (:Entity)-[:FILED]->(:Filing)\\n- (:Entity)-[:COUNTRY]->(:Country)\\n\\nBut since the question is about entities linked as beneficiaries, I should focus on the `:BENEFITS` relationship. Each `:Filing` node can have multiple `:Entity` nodes connected via `:BENEFITS`, meaning each entity is a beneficiary in a filing.\\n\\nTo find the countries with the most entities as beneficiaries, I need to:\\n1. Identify all `:Entity` nodes connected via `:BENEFITS` to `:Filing` nodes.\\n2. For each of these entities, find their `beneficiary_bank_country` property, which should be the country of the bank acting as the beneficiary.\\n3. Count how many entities have their `beneficiary_bank_country` as each country.\\n4. Sort these countries by the count of entities and select the top three.\\n\\nI should also consider if there are any constraints or properties that might affect this count. For example, if an entity appears multiple times in different filings, each occurrence should be counted separately. However, the schema doesn\\'t specify if an entity can be linked multiple times to the same country, so I\\'ll assume each connection is a separate count.\\n\\nNow, translating this into a Cypher query. I need to:\\n- Start with the `:Entity` nodes.\\n- Filter those that have a `:BENEFITS` relationship to a `:Filing`.\\n- Group these entities by their `beneficiary_bank_country`.\\n- Count the number of entities per country.\\n- Order the results by count in descending order.\\n- Select the top three countries.\\n\\nPutting this into a Cypher statement, it would look something like this:\\n\\n```cypher\\nMATCH (e:Entity {relationship: [:BENEFITS]}) \\n OPTIONAL MATCH (f:Filing)-[:BENEFITS]->(e)\\n RETURN e.beneficiary_bank_country, COUNT(e) AS count\\nORDER BY DESC(count)\\nLIMIT 3\\n```\\n\\nWait, that might not be exactly right. Let me refine it. I need to ensure that I\\'m only considering entities that have at least one `:BENEFITS` relationship. Also, the `relationship` property in the `:BENEFITS` relationship is optional, so I should adjust the match pattern accordingly.\\n\\nPerhaps a better approach is:\\n\\n```cypher\\nMATCH (:Filing)-[:BENEFITS]->(:Entity)\\n OPTIONAL MATCH (:Filing)-[:BENEFITS]->(:Entity)\\n OPTIONAL MATCH (:Filing)-[:BENEFITS]->(:Entity)\\n  ... but this seems repetitive. Instead, I can use a subquery to get all entities connected via `:BENEFITS` to `:Filing`.\\n\\nWait, maybe a better way is to use a projection that includes all entities that are connected via `:BENEFITS` to `:Filing`. Then, group by `beneficiary_bank_country` and count.\\n\\nSo, the correct Cypher statement would be:\\n\\n```cypher\\nMATCH (:Filing)-[:BENEFITS]->(:Entity) AS e\\nGROUP BY e.beneficiary_bank_country\\nORDER BY COUNT(e) DESC\\nLIMIT 3\\n```\\n\\nBut I think I need to ensure that each entity is only counted once per country, even if they appear in multiple filings. However, the question asks for the number of entities linked as beneficiaries, so each unique entity per country is counted once, regardless of how many times they appear in different filings.\\n\\nWait, no. If an entity is a beneficiary in multiple filings, it should still be counted once per country, but the count should reflect how many times the entity is linked to that country. But I think the question is asking for the number of unique entities per country, not the number of times they appear in filings.\\n\\nWait'"
            ],
            "application/vnd.google.colaboratory.intrinsic+json": {
              "type": "string"
            }
          },
          "metadata": {},
          "execution_count": 46
        }
      ]
    },
    {
      "cell_type": "code",
      "source": [
        "\n",
        "tokenizer.pad_token = tokenizer.eos_token\n",
        "question = \"What are the movies of Tom Hanks?\"\n",
        "schema = \"(:Actor)-[:ActedIn]->(:Movie)\"\n",
        "new_message = prepare_chat_prompt(question=question, schema=schema)\n",
        "prompt = f\"<|im_start|>{new_message}.<|im_end|>\\n<|im_start|>assistant\\n\"\n",
        "\n",
        "inputs = tokenizer(prompt, return_tensors=\"pt\").to(model.device)\n",
        "outputs = model.generate(\n",
        "    **inputs,\n",
        "    max_new_tokens=1000,\n",
        "    temperature=0.7,\n",
        "    top_p=0.9,\n",
        "    pad_token_id=tokenizer.eos_token_id\n",
        ")\n",
        "response = tokenizer.decode(outputs[0], skip_special_tokens=False)\n",
        "response\n",
        "\n"
      ],
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/",
          "height": 123
        },
        "id": "W9CvYC6vlo4k",
        "outputId": "fbe69850-849a-4a24-9495-30c93ae4a79e"
      },
      "execution_count": null,
      "outputs": [
        {
          "output_type": "execute_result",
          "data": {
            "text/plain": [
              "'<｜begin▁of▁sentence｜><|im_start|>[{\\'role\\': \\'user\\', \\'content\\': \\'Generate Cypher statement to query a graph database. Use only the provided relationship types and properties in the schema. \\\\nSchema: (:Actor)-[:ActedIn]->(:Movie) \\\\n Question: What are the movies of Tom Hanks?  \\\\n Cypher output: \\'}].<|im_end|>\\n<|im_start|>assistant\\nOkay, so I need to generate a Cypher statement to query a graph database. The user provided a schema and a question, so let me break this down step by step. \\n\\nFirst, the schema is (:Actor)-[:ActedIn]->(:Movie). This means that there\\'s a relationship between Actors and Movies where the actor has acted in the movie. So, the relationship type is ActedIn, connecting an Actor to a Movie.\\n\\nThe question is: \"What are the movies of Tom Hanks?\" So, essentially, I need to find all the Movies that are connected to Tom Hanks through the ActedIn relationship.\\n\\nIn Cypher, to query this, I would start by selecting the Movie nodes. Then, I need to find the connections between Tom Hanks (as an Actor) and the Movies. So, the FROM clause would start with Movie, but I think it\\'s more straightforward to specify the relationship type directly in the WHERE or the projection.\\n\\nWait, actually, in Cypher, you can use the relationship directly in the projection. So, I can write something likeMATCH (Actor {name: \\'Tom Hanks\\'})-[:ActedIn]->(Movie). Then, to collect all the Movies, I can use the WITH clause to project the Movie properties.\\n\\nPutting it all together, the Cypher statement would match the path where Tom Hanks is connected via ActedIn to a Movie, and then return those Movies. So, the statement would be: \\n\\nMATCH (Actor {name: \\'Tom Hanks\\'})-[:ActedIn]->(Movie)\\nWITH Movie\\nRETURN Movie\\n\\nThis should return all the Movies that Tom Hanks has acted in. I think that covers the user\\'s request. I should make sure to use the correct syntax, like single quotes around the property values and proper case for relationship types.\\n\\nI don\\'t think I need to include any additional clauses unless the user specified something else, but for this question, this should suffice. Also, I should ensure that the Cypher is case-sensitive, so the relationship type ActedIn should be in uppercase as per the schema.\\n\\nSo, the final output would be the Cypher statement as above, without any extra information or explanations, just the code block.\\n</think>\\n\\n<|im_start|>[{\\'role\\': \\'assistant\\', \\'content\\': \\'MATCH (Actor {name: \\\\\"Tom Hanks\\\\\"})-[:ActedIn]->(Movie)\\\\n WITH Movie\\\\n RETURN Movie\\'}].<|im_end|><｜end▁of▁sentence｜>'"
            ],
            "application/vnd.google.colaboratory.intrinsic+json": {
              "type": "string"
            }
          },
          "metadata": {},
          "execution_count": 10
        }
      ]
    },
    {
      "cell_type": "code",
      "source": [
        "<｜begin▁of▁sentence｜><|im_start|>[{'role': 'user', 'content': 'Generate Cypher statement to query a graph database. Use only the provided relationship types and properties in the schema. \\nSchema: (:Actor)-[:ActedIn]->(:Movie) \\n Question: What are the movies of Tom Hanks?  \\n Cypher output: '}].<|im_end|>\n",
        "<|im_start|>assistant\n",
        "Okay, so I need to generate a Cypher statement to query a graph database. The user provided a schema and a question, so let me break this down step by step.\n",
        "\n",
        "First, the schema is (:Actor)-[:ActedIn]->(:Movie). This means that there's a relationship between Actors and Movies where the actor has acted in the movie. So, the relationship type is ActedIn, connecting an Actor to a Movie.\n",
        "\n",
        "The question is: \"What are the movies of Tom Hanks?\" So, essentially, I need to find all the Movies that are connected to Tom Hanks through the ActedIn relationship.\n",
        "\n",
        "In Cypher, to query this, I would start by selecting the Movie nodes. Then, I need to find the connections between Tom Hanks (as an Actor) and the Movies. So, the FROM clause would start with Movie, but I think it's more straightforward to specify the relationship type directly in the WHERE or the projection.\n",
        "\n",
        "Wait, actually, in Cypher, you can use the relationship directly in the projection. So, I can write something likeMATCH (Actor {name: 'Tom Hanks'})-[:ActedIn]->(Movie). Then, to collect all the Movies, I can use the WITH clause to project the Movie properties.\n",
        "\n",
        "Putting it all together, the Cypher statement would match the path where Tom Hanks is connected via ActedIn to a Movie, and then return those Movies. So, the statement would be:\n",
        "\n",
        "MATCH (Actor {name: 'Tom Hanks'})-[:ActedIn]->(Movie)\n",
        "WITH Movie\n",
        "RETURN Movie\n",
        "# [\"MATCH (a:Actor {Name: 'Tom Hanks'})-[:ActedIn]->(m:Movie) RETURN m\"]\n",
        "\n",
        "This should return all the Movies that Tom Hanks has acted in. I think that covers the user's request. I should make sure to use the correct syntax, like single quotes around the property values and proper case for relationship types.\n",
        "\n",
        "I don't think I need to include any additional clauses unless the user specified something else, but for this question, this should suffice. Also, I should ensure that the Cypher is case-sensitive, so the relationship type ActedIn should be in uppercase as per the schema.\n",
        "\n",
        "So, the final output would be the Cypher statement as above, without any extra information or explanations, just the code block.\n",
        "</think>\n",
        "\n",
        "<|im_start|>[{'role': 'assistant', 'content': 'MATCH (Actor {name: \\\"Tom Hanks\\\"})-[:ActedIn]->(Movie)\\n WITH Movie\\n RETURN Movie'}].<|im_end|><｜end▁of▁sentence｜>"
      ],
      "metadata": {
        "id": "wDXtOMQuohL_"
      },
      "execution_count": null,
      "outputs": []
    },
    {
      "cell_type": "code",
      "source": [
        "torch.cuda.empty_cache()"
      ],
      "metadata": {
        "id": "e0UhIu9LMq10"
      },
      "execution_count": null,
      "outputs": []
    }
  ]
}